hzpool = ('А?','Что, простите?','Чё?','Я не понял','Это ты мне?','Как сам?','Ты ничё не путаешь?','Не понимаю тебяяя','Ну я хз','Понятия не имею, к чему ты это говоришь','Моя твоя не понимать','Ммм?','Куку','Сам пёс','Нет, ты!','Дерзишь')

anekpool=(
'''Мужик приходит магазин, покупать шляпу. Одну померил, другую, ни одна не подходит. К нему подходит продавщица:
- Мужчина, может Вам папаху дать?
- По пизде себе дай, дура бешеная!'''
,'''Будённый рассказывает кавалеристам:
— Помню, эдак, в 1918 году выезжаю на берег реки. Посмотрел налево: ёб твою мать! Посмотрел направо: ох, ёбаный в рот!
Кавалеристы:
— Вот это память у старика!'''
,'''- Изя, где вы брали такие брюки? 
- Моше, эти брюки я брал в Париже. 
- Изя, а где это? 
- Моше, это 2000 км от Одессы. 
- Та вы шо! Такая глушь, а как шьют…'''
,'''К одной старухе, торговавшей редиской у метро по 10 руб. за пучок, 
каждый день подходит один и тот же молодой человек, оставляет ей 
десятку, но редиску не берет. И вот однажды, когда он в очередной раз 
отстегнул бабке чирик, та хватает его за руку. Молодой человек говорит: 
- Я так понял, вам интересно, почему я оставляю вам деньги, но ничего не 
беру? 
- Нет, это меня как раз не интересует. Просто с сегодняшнего дня редиска 
стоит 15 рублей.'''
,'''Два мужика бухают в гостинице. Один говорит другому:
- Видишь, розетка. Наверняка там микрофончик встроенный. Давай, хуякнем
по ней ботинком, чтобы кому-то по ушам шарахнуло.
Из розетки голос:
- Я тебе щас хуякну'''
,'''Девушка раздевается у себя в квартире. Сняла платье, лифчик, трусики, стала смотреть на себя в зеркало, повернулась правым боком, левым, погладила себя по бедрам, приподняла грудь… Поворачивается и с ужасом видит, что за раскрытым окном висит люлька, а в ней штукатур. От неожиданности теряется и ошалело смотрит на этого штукатура.
Штукатур:
— Ну, что уставилась? У тебя хуй видно.'''
,'''По коридору ВУЗа идет профессор. Навстречу студент:
- Здравствуйте, профессор. Можно Вас спросить?
- Конечно, спрашивайте, молодой человек.
- Скажите, профессор, Вы когда спать ложитесь, бороду
на одеяло или под одеяло кладете?
После некоторой паузы:
- Да, знаете, как-то не задумывался.
- Ну, извините, пожалуйста.
Разошлись.
Через неделю зеленый профессор с кругами под глазами
встречает в коридоре того же студента и хватает за грудки:
- Ну ты и сволочь! Неделю уже спать не могу - и так неудобно,
и так неудобно!'''
,'''Едут два пидора в трамвае. Час пик, давка. Один другому говорит: 
- Котик, давай ты меня выебешь прямо здесь?
- Что ты, мой сладкий, тут же народу так много. 
- Ой, ты зря переживаешь, тут всем наплевать, никто и не заметит. 
- Ну не знаю... 
- Вот смотри. (громко) Граждане, который час? 
Никто даже не оборачивается. 
- Теперь понимаешь? Давай, снимай штаны скорее. 
Конечная остановка, в трамвае в одиночестве сидит пожилой мужчина. Кондуктор подходит к нему: 
- Дедушка, а чего вы сидите? 
- Ой, милок, так сердце прихватило что-то, еле дышу. 
- Ну так попросили бы у пассажиров валидола, у кого-нибудь да оказался бы. 
- Да попросишь тут, один спросил, который час, так его всю оставшуюся дорогу в жопу ебали.'''
,'''Туркменской семье настолько понравились кэшбэки, что они начали готовить их дома.'''
,'''Журналисты спрашивают у фермера:
- Скажите, как у вас прошел год.
- Не поверите, замечательно. Урожай зерна хороший - без хлеба не
останусь, картошка удалась - опять таки буду не голодный, а еще свинья
опоросилась...
- Вы не хотели бы поблагодарить за это президента?
- Да с чего ж? Пахал сам, сеял сам, растил и собирал опять таки сам - в
чем тут его заслуга.
- Как так? (жестко) А вы подумайте!
- А, ну ежли подумать, то за свинью спасибо'''
,'''Режиссер возвращается домой пьяный и орет:
- Так, быстро таз, я буду блевать!
Жена приносит таз. Режиссер:
- Все, унесите, концепция поменялась: я обосрался.'''
,'''Жил-был юноша с плохим характером . Отец дал ему полный мешок гвоздей и сказал, забивать один гвоздь в ворота сада каждый раз, когда тот потеряет терпение или поругается с кем ни будь . В первый день он забил 37 гвоздей в ворота. В последующие недели научился контролировать количество забитых гвоздей, уменьшая его изо дня в день: Понял, что проще контролировать себя, чем забивать гвозди . Наконец, наступил тот день, когда юноша не забил ни одного гвоздя в ворота сада . Тогда он пришел к отцу и сказал ему эту новость. Тогда отец сказал юноше, вынимать один гвоздь из ворот, каждый раз когда он не потеряет терпение . Наконец наступил тот день, когда юноша смог сказать отцу, что вытащил все гвозди . Отец подвел сына к садовым воротам : « Сын , ты прекрасно себя вел, но посмотри, сколько дырок осталось на воротах. Никогда они уже не будут такими как раньше. Из-за тебя весь забор к херам развалился. Почему ты такой мудак, что не мог просто не ругаться? Все гвозди в доме в это херов забор вбил. Ни гвоздей, нет, ни забора! Чтобы тебя ночью украли!"
- Пап, на возьми мешок гвоздей, забивай их в стену дома, тогда ты не будешь так злиться. Мне помогло!
- В жопу себе гвозди забей, щенок! Забор новый строить будешь, -ответил отец'''
,'''Папа с сыном пошли однажды в горы, и сын, ударившись о камень, крикнул:
— ААААААА.
И с удивлением слышит:
— ААААААА.
Мальчик спросил:
— Кто ты?
А ему в ответ:
— Кто ты?
Разозлившись от такого ответа, мальчик кричит:
— Трус!
А ему в ответ:
— Трус!
Мальчик спрашивает у отца: «Что происходит?»
Отец улыбнулся и говорит: «Кому эхо в горах, а тебе вагон каках» и уебался насмерть с горы.
На следующий день у мальчика отвалилась жопа.'''
,'''Сидят два парня в кинотеатре и ждут начало фильма. Тут перед ними
садится здоровый лысый мужик. Один парень, ехидно улыбаясь, говорит
другому:
- Давай спорим на полтинник, что ты не сможешь шлепнуть его по лысине!
Тот, немного подумав:
- А вот и смогу, давай спорить.
Ну поспорили. Парень немедля шлепает лысого мужика по башке.
Тот охуевши оглядывается, типа че такое? Парень сразу же:
- Бля, Леха! Скоко лет, скоко зим! где пропадал?
Лысый, покраснев, говорит:
- Какой на хер Леха, вы перепутали!
Лысый отворачивается. Проходит несколько минут, и первый парень опять:
- Слабо второй раз шлепнуть? Спорим на сотку?
- Конечно нет, давай спорим, что шлепну еще раз.
Такая же ситуация, лысый уже готов ебнуть парня. А тот в ответ:
- Бля, Леха, че ты придуриваешься? Мало что ты побрился, еще меня не
узнаешь!
Лысый разозленный поднимается и идет на передние ряды, чтобы не
беспокоили эти уроды. Проходит еще несколько минут:
- Слабо еще раз шлепнуть? Спорим на 500?
- Давай, спорим.
Парень поднимается, идет к лысому, не раздумывая шлепает по лысине и
кричит:
- Бля, Леха! Ты, оказывается, здесь сидишь, а я там уже полчаса одного
Заёбываю!'''
,'''Перед посещением английской королевой военного госпиталя в него пожаловала комиссия. У одного из раненых пациентов в палате был обнаружен удивительный порядок и чистота, выстиранные занавесочки, цветочки в вазе, вкусный завтрак на подносе, белоснежное белье, в общем, рай. 
- Какая красота, - удивляется комиссия. - А позвольте узнать, откуда? 
- Так санитарки за мной ухаживают как-то по-особенному. 
- И куда вы ранены, молодой человек? 
- В хуй.
- Да вы что, с ума, что ли сошли?! Завтра королева прибудет, а вы такие вещи говорите. Вы уж, пожалуйста, нас не позорьте, придумайте какой-нибудь другой ответ. 
- Хорошо. 
Приходит королева, ходит-бродит, видит такую замечательную палату и тоже не удерживается от вопроса, "Почему?". 
- Так санитарки ухаживают, Ваше Величество. 
- А куда же вы ранены? 
- В низ живота, Ваше Величество. 
- Хорошо, что не в хуй, - испугалась королева.'''
,'''Разговаривают, значит, два грузина:
— Дарагой, что ты в Масква видель! 
— Э-э-э, Масква, слушяй, хороший город. Крэмль видэль, Лэнин видэль, балэт видэль... 
— Гиви, расскажи, что такое балэт, а? 
— Э-э-э, балэт. Это такой балшой дом с калоннами. Заходиш- там всэ раздеваюца. В зал праходиш — а там прэдставлэние. 
— А какое, дарагой? 
— Ну, сначала вибежяль на сцену один мужик и три баба. Мужик к адной падбежяль, ей ногу паднял, панюхал- нэ эго. Кдругой падбежял, панюхал- нэ эго. К трэтей падбежял, панюхал-эго! Взвалил ее на плэчо, туда пабежял- нэгдэ эбать, сюда пабежял- нэгдэ эбать. Стал мужик с нэй пасрэди сцэны и плачэт... А всэ со своих мест подорвалис и крычат, панимаеш: "Э бис, э бис! " А гдэ эбис, если нэгдэ…'''
,'''Встретились Хой, Горшок и Летов, ну и вздумали бухнуть. Купили литруху, ну и типа говорят - мы же поэты - давайте кто сколько в стихах попросит, тому столько и нальём.
Хой встаёт:
- Рыбка плавает по дну, выпью рюмочку одну.
Налили. Горшок встал:
- Рыбка мёртвая на дне, выпью рюмочки я две.
Летов встаёт, весь натужился, набух, покраснел, глаза выпучил. Вдруг как заорёт:
- АААА БЛЯЯЯДЬ НАХУУУЙ
Схватил пузырь и убежал.'''
,'''Если мужика будут звать Б, то у его сына будет отчество Бич'''
,'''Сидят мужики и пьют пиво. Потом один из них достает из кармана ма-а-а-аленького мужичка, ставит его на стол, наливает ему в наперсток пива и говорит: 
— Ну, Петрович, расскажи мужикам, как ты в Африке колдуна нахуй послал…'''
,'''Белка летяга всю жизнь мечтала летать. Так и не полетела, хоть и планировала.'''
,'''— Какой самый сложный трюк в скейтбординге? 
— Жить отдельно от родителей'''
,'''Сидит дома композитор. Работы нет. Денег нет. 
И тут звонок, звонит приятель — режиссёр:
— Слушай, мне тут к фильму темка нужна на финальные титры. Сбацаешь что-нибудь простенькое?
— Да не вопрос! Расскажи только, о чём фильм, чтобы я с музыкальной темой не промахнулся?
— Да в нём вообще музыки нет! Тема только для титров нужна. Ну представь себе: с сухого дерева лист медленно зигзагом падает на мокрый асфальт, и как только долетает до земли, начинается твоя тема и титры.
— Ок. Через неделю сделаю! 
И композитор с голодухи скреативил неимоверно красивую, дивную музыку — хоть сейчас на "Оскара". Ну и отправил режиссёру. Тот ответил, мол, всё отлично, и пригласил на премьеру.
Приходит композитор — зал пустой. Только на галёрке парочка пожилая сидит, обоим далеко за 80. Ну, думает композитор, ясное дело — драма нынче не в цене, никого кроме старичков не интересуют. Сел он, свет погас, и началось.
На фоне природы мужик самозабвенно трахает тёлку с огромными, как баскетбольные мячи, сиськами. Дальше — больше, ещё парочка подошла, поменялись. Потом пришли негры, калеки, карлики — уже вся эта кодла в экран не помещается! Потом вообще собака прибежала, сначала собака всех отодрала, потом все собаку трахнули. И тут камера берёт крупный план, наезжает на сухое дерево, на лист, лист срывается и медленно падает зигзагом на землю, звучит неземная, дивная тема и идут титры.
Зажигается свет. Композитор сидит в шоке, красный как помидор от стыда. Думает: "ну, сука, режиссёр, ну удружил! Что обо мне люди подумают!". Встаёт со своего места, с этими мыслями идёт к выходу и тут замечает, что пожилая парочка в предынфарктном состоянии сидит и на него смотрит. И он ничего лучшего не находит, как сказать: — Музыка моя!
А они, продолжая смотреть стеклянными глазами, отвечают: 
— А собачка наша!'''
,'''Пошли как то раз в театр поручик Ржевский, Андрей Болконский, Пьер Безухов и, конечно же, Наташа Ростова. Сидят смотрят постановку. Тут Болконский говорит Наташе:
- Наташа, а у вас на спинке стула какое-то слово написано.
- А какое?
Болконский замялся:
- Ну... Первая буква такая же как в слове "холод", - и толкает локтем Безухова.
Пьер сразу сориентировался:
- А вторая такая же как в слове "суд", - и толкает Ржевского.
Поручик:
- А третья буква такая же, как третья буква в слове "хуй".'''
,'''Сидят две мухи. Говно жрут. Тут одна и говорит: 
-Бля, вот это я наелась, пойду посру
Вторая возмущённо:
-Сука, весь аппетит испортила'''
,'''— Пап, а что такое альтернатива? 
— Сложно объяснить в двух словах, ну вот на примере: 
Ты работаешь на заводе, из года в год пашешь и пашешь, постепенно копишь бабки. В один прекрасный момент, тебе денег хватает на переезд в деревню. Ты покупаешь десяток яиц и выводишь из них цыплят. Кормишь их, поишь, ухаживаешь за ними, они подрастают и начинают нести яйца. Ты их в инкубатор и вот у тебя уже тысячи цыплят. Ты за ними ухаживаешь и вот у тебя уже тысячи взрослых кур. И вот эти тысячи кур начинают нести яйца - ты уже крутой фермер! И тут наводнение-полный пиздец! Всю твою ферму смывает, всё сдохло, всё смыто... 
— Пап, ну и где альтернатива? 
— Утки!'''
,'''Клуб любителей радиоактивных элементов распался.'''
,'''Ползут две черепахи по пустыне. Одна спрашивает: 
– Чё, гололёд что ли? 
– Да не, вроде не похоже. 
– А нахуя тогда столько песка насыпали?'''
,'''Стоят два мужика, травят анекдоты. Один мужик:
— Знаешь, чем мент отличается от осла?
И тут чувствует у себя на плече чью-то тяжелую руку.
Оборачивается — сзади мент.
Мент (грозно):
— Hу и чем же?
Мужик:
— Да ничем!
Мент:
— Hу то-то же!'''
,'''Трем пентагоновским генералам начисляют пенсию. Их просят назвать какой-либо свой физический параметр в цифрах, который будет потом умножен на базовый коэффициент для получения окончательного размера пенсии. Первый генерал был очень высок и назвал свой рост. Второй генерал не был высок, но обладал очень длинными руками и ему измерили расстояние между раздвинутыми руками. Третий генерал был обыкновенный и предложил измерить расстояние от конца своего члена до яиц. Комиссия: 
— Вы уверены, что это подходящий параметр?! 
Генерал: 
—Так точно. Уверен. 
Комиссия для убедительности переспросила еще пару раз, но генерал отвечал, что он совершенно уверен. Комиссия приступила к измерениям, но тут один из ее членов заметил неладное и воскликнул: 
— Ой! А где же яйца!?! 
Генерал: 
— В Ираке!'''
,'''— Скажи мне кто твой друг и я скажу тебе кто ты. 
— Кто твой друг? 
— Кто ты?'''
,'''Идет лекция по математике, в аудитории лектор и 3 студента. 
Внезапно встают 5 человек и уходят. 
Лектор: 
- Вот сейчас придут еще двое, и вообще никого не останется.'''
,'''Решил мужик поклеить обои в спальне.Купил,значит,поклеил.Приходит к нему сосед и говорит: 
—Заебок поклеил!У меня такая же спальня,тоже поклею себе.Ты сколько рулонов брал? 
—Десять. 
—Ок. 
Значит,пошел сосед,купил обои,поклеил и на следующий день приходит к мужику и говорит: 
—Дебил, ты нахрена мне сказал 10 рулонов брать??? У меня еще 4 осталось. 
—Так у меня тоже 4 осталось.'''
,'''Цирк. Представление в разгаре. Конферансье объявляет: 
- у нас сенсация! Карлик с феноменальной памятью! 
Выходит карлик и минут 15 тупо смотрит в зал. Людям это наскучило, из зала начали доноситься недовольные возгласы. Конферансье: 
- а теперь карлик обоссыт всех из первых двух рядов! И не пытайтесь бежать, он всех запомнил. 
Паника, люди бегут, но карлик реально догнал каждого и обоссал. 
...но у одного мальчика папа работал в прокуратуре. Мальчик смахнул с лица мочу и позвонил отцу. Через десять минут приехал спецназ, карлика поймали и засунули ему в жопу паяльник. Конферансье сломали челюсть, директора цирка окунули в унитаз. Даже слона отпиздили. 
А мальчик вообще сидел на 15 ряду. Он сам себя обоссал'''
,'''Парень пишет своей девушке семикласснице:
—что делаешь? 
—я на уроке физики, а ты? 
—а я на информатике 
—что у вас за школа, как не спрошу, так ты на информатике!! 
—я учитель информатики'''
,'''Мужчина просит продавщицу: 
- Дайте мне 200 грамм колбасы.Только нарежьте мне 120 грамм слева направо, а 80 грамм - справа налево. 
Та посмотрела на него и уверенно: 
- А вы, похоже,полицейский! 
- Да. А как вы догадались? 
- А на вас форма полицейская.'''
,'''Аpмия. Постpоение. Hовобpанцы. Капитан: 
—Иванов! 
—Я! 
—Кем был до аpмии? 
—Каменщиком. 
—Hоpмально. Будешь класть казаpмы. Петpов! 
—Я! 
—Кем был до аpмии? 
—Маляpом. 
—Hоpмально. Будешь кpасить казаpмы. Сидоpов! 
—Я! 
—Кем был до аpмии? 
—Клюкальщиком. 
—Кем-кем? 
—Клюкальщиком! 
—А что же ты, Сидоpов, делал? 
—Клюкалы, товаpищ капитан! 
—Hи хуя себе! А что же это за вещь, это самое клюкало? 
—А вот дайте мне лист железа, молоток, сварочный аппарат, дрель и мастеpскую, так я вам в тpи дня такое клюкало сделаю! 
—Hу ладно, давай. 
Дают Сидоpову все, что он попpосил, и он удаляется в мастеpскую. Тpое суток из мастеpской доносится шум, летят искpы, валит дым. И вот чеpез тpи дня выходит из мастеpской Сидоpов, весь гpязный, растрепанный, закопченый, вспотевший, но гоpдый. И несет он пеpед собой лист железа, вес помятый, в дыpах, сто pаз свеpнут и пеpегнут. 
Охуевший капитан спpашивает: 
— Сидоpов. Что это это у тебя за хуйня? 
— Клюкало. 
— Да ты че, Сидоpов, блядь, охуел что ли? Вздумал нас ебать? Hа губу нахуй! 
Уводят Сидоpова на губу, клюкало бpосают в кабинет капитана. 
Пpоходит неделя. В часть с пpовеpкой пpиезжает генеpал. 
Идет, все осматpивает, все ему нpавится, и как казаpмы покpашены, и чистота везде. 
Заходит к капитану, и вдpуг видит в углу клюкало. 
— Hи хуя себе, вот это да, вот это клюкало! Кто сделал? 
Охуевший капитан: 
—Сидоpов. 
— Где Сидоpов? 
— Hа губе. 
— Да вы что тут, охуели все в конец, быстpо его сюда! 
Пpиводят Сидоpова. 
— Сидоpов. Ты сделал такое заебенное клюкало? 
— Я. 
—И сколько ж ты, скажи мне, делал его? 
— Тpи дня. 
— Hи хуя ж себе! У меня на такое клюкало не меньше месяца уходит! Пойдем запустим!? 
— Конечно, товаpищ генеpал, о чем pечь! 
Идут генеpал с Сидоpовым на озеpо. Садятся в лодку и 
заплывают на самую сеpедину. 
Генерал говорит: 
— Ну что, я клюкало запущу? 
— Давайте. 
Генеpал беpет остоpожно клюкало в pуки, поднимает над головой, замахивается и кидает в озеpо. Клюкало с хаpактеpным звуком КЛЮК уходит в озеpо. 
Генеpал восхищенно, взволнованным голосом. 
— глянь, как пошло, как пошлоо-то!'''
,'''Идет спектакль. 
Вдруг истошный вопль из бельэтажа: 
— Доктор! Здесь есть доктор?! 
Из зала: 
— Да! 
— Коллега, что за хуйню нам показывают?'''
,'''В английском гольфклубе появился новый посетитель, да так ловко кладет все мячи в лунки, что один из завсегдатаев не выдержал и подошел к нему. 
—Cэр,позвольте поинтересоваться вашим родом деятельности 
—Я наемный убийца,а в сумке для клюшек винтовка с оптическим прицелом 
Завсегдатай достает винтовку и направляет в сторону своего дома и видит в окне свою раздевающуюся жену и голого мужика 
—Сэр, а сколько у вас стоит один выстрел?
—Тысяча фунтов 
—Плачу две, жене в голову, чтобы не мучилась, а этому отстрелите член 
Киллер целится пять минут, десять, двадцать. На вопрос в чем дело отвечает: 
—Понимаете сэр, я пытаюсь сэкономить вам тысячу фунтов'''
,'''Один робот трахался с кем попало и подхватил браузер амиго.'''
,'''На собеседовании: 
—А у Вас есть какое нибудь хобби? 
—Вообще-то есть парочка 
Достает чучело хомяка из кармана. 
—Таксидермия 
—И чревовещание, - добавляет хомяк'''
,'''заходит как-то давление в один бар в один бар'''
,'''Будят утром капитана истошным воплем над ухом: 
- Капитан пробоина по ватерлинии!!!!!
Капитан не долго думая надевает жилет и прыгает за борт. Летит и думает: 
"Какая нахуй пробоина?? По какой суканахуй ватерлинии?? Я вообще лётчик!!" "'''
,'''Весна. По доpоге идут паpень с девушкой. Вокpуг кpасота, птички поют, чеpвячки пеpеплетаются. Паpень намекает, мол, давай зайдем в лесок. Девушка в ответ кивает головой. Заходят они в лесок, нашли подходящую полянку, pазложились, ну и долбятся. Hо вдpуг, паpню pезко пpиспичило по малой. Он и говоpит: 

- Слушай, доpогая, я сейчас отлучусь в кусы, отолью, веpнусь и мы с тобой пpодолжим. - Ты что, не знаешь? В этом лесу живет быстpый Гонзалес! - ...? - Hу, как только ты отойдешь, он пpибежит и начнет меня ебать. - Hу хоpошо, тогда я отвеpнусь, отолью, повеpнусь и мы с тобой пpодолжим. - Hет, ты не понял - это быстpый, очень быстpыйй Гонзалес. - Hеужели такой быстpый? - Да пиздец какой быстpый. - Хоpошо. Тогда я выну, отвеpну в стоpону, отолью, а тебе заткну пальчиком, чтоб Гонзалес ничего не сделал. Девушка, подумав, соглашается. Паpень достает, отвоpачивает, и засовывает палец в жопу быстpому Гонзалесу.'''
,'''Учительница биологии: дети, сегодня я расскажу вам об осьминогах.
Осьминоги живут на дне океана. Передвигаются при помощи щупалец. Сначала очень медленно. Ползут по песку, ползут. 
По направлению к берегу. Сначала медленно, потом чуть быстрее. Затем ускоряются и уже на полной скорости бегут к берегу, 
выбегают на берег, дальше, дальше, ускоряются, через равнины, пустыни, стремительно несутся к горам, набирают скорость, 
на громадной скорости вбегают на гору, с вершины — в небо, в стратосферу, затем в космос… 
— Мария Ивановна, мне кажется, Вы нам неправду рассказываете! — голос с первой парты. 
— Девочка, как твоя фамилия? 
— Иванова. 
— Где у нас журнал? Так и запишем: «Иванова — ебанутая»!'''
,'''Павел Николаевич зашёл в блинную и, не найдя вешалки для шляпы, был очень огорчён. Просидев пятнадцать минут за столиком и отведав два фаршированных ягодами блина он вдруг не выдержал и закричал:
-НУ И КУДА БЛЯДЬ МНЕ ШЛЯПУ ПОВЕСИТЬ В ВАШЕМ ЕБАНОМ ГАДЮШНИКЕ?
Все сконфузились, но ситуацию спас полицмейстер. Он пришёл и сказал:
-Полно Вам, Павел Николаевич, баловаться, грешно это. Да и шляпы нету у Вас. - и Павел Николаевич с позором покинул блинную.'''
,'''Как-то раз поручика Ржевского попросили рассказать каламбур. Тот не растерялся: 
- Калом бур, но телом бел.'''
,'''Штирлиц шел с трудом разбирая дорогу. На утро Гитлеру доложили, что разобрано пятнадцать километров железнодорожных путей'''
,'''Едет скорый поезд на полной скорости. Вдруг он съезжает с рельс, проскакивает лесополосу, кукурузное поле и вновь возвращается на рельсы. Обалдевшие пассажиры спрашивают у машиниста:
- Что это было?
- Едем, смотрю мужик на рельсах срет.
- Так давить надо было!
- Так вот только в кукурузе и догнали!'''
,'''8-летний мальчик приходит домой из школы и говорит: 
- Мама, пока папы нет дома, давай с тобой поиграем в папу с мамой. 
- Вообще-то мне некогда: 
- Ну мамочка, ну только один разочек! 
- Ну, хорошо. 
- Тогда я сажусь на диван и начинаю смотреть телевизор, как папа, а ты принесешь мне стакан пива. Потом приготовишь поесть. 
- Ладно. 
Через несколько минут мама приносит ему стакан так называемого пива. Мальчик: 
- А теперь надевай красивое платье с широким декольте, как ты делаешь, когда вы вместе с папой. Будем садиться за стол. 
- Сейчас, сынок. 
Пообедав, мальчик говорит: 
- А теперь, мама, надевай сексуальное белье, как ты делаешь с папой, и ложись в постель. Я сейчас к тебе приду. 
- Хорошо, сынок. 
Через некоторое время мальчик заходит в комнату, где мама уже лежит в постели, сам ложится в постель, обнимает маму и говорит ей на ушко: 
- Ты знаешь, дорогая, я думаю, нашему мальчику нужно купить велосипед!'''
,'''- Изя, ну и как Сарочка в постели?
- помещается.'''
,'''Приходит бабушка в поликлинику к врачу. Заходит в кабинет, ну тут врач спрашивает, что да как,
-да вот больно что-то сзади мне, срать не могу. - говорит бабушка
Доктор попросил ее раздеться и наклониться. Ну тут врач смотрит и говорит: бабушка, да у вас тут газетка застряла
-неужто правда?
-нет, известия'''
,'''Мужик на телеге въезжает в село: 
— Люди, я уголь привёз!!! 
Лошадь оборачивается: 
— Охуеть бля, он привёз!!!'''
,'''Идут два негра по улице. У одного доллар, у другого 98 центов. Вдруг видят салон в котором людей делают белыми за 99 центов. Один черный говорит другому- "давай я зайду, стану белым, отдам тебе цент сдачи, а потом пойдешь ты?" Хорошо -соглашается второй. Через пол часа из салона выходит высокий белый блондин с белоснежной улыбкой. 
-Ух ты, я тоже хочу, дай мне цент!
-Найди работу, нигер.'''
,'''Комполка вызывает лейтенанта.
- Слушай, лейтенант, ты каждый вечер в кабаке зависаешь! Даже я со своей зарплатой не могу себе такого позволить! Откуда деньги?! Топливо продаёшь, сучёныш?!
- Никак нет, товарищ полковник! Споры выигрываю!
- Это как?
- А вот давайте на Вашу зарплату поспорим, что у Вас завтра утром здоровенный прыщ на жопе вскочит!
Поспорили.
Утром командир вызывает лейтенанта.
- Всё, лейтёха! Готовь бабки! Прыща-то нет!
- Да не может быть! Как же так?!
- Вот так, лейтенант! Будет тебе наука!
- Товарищ командир, разрешите проверить. Деньги-то немалые! Только к окну подойдите, здесь светлее.
-На! Проверяй!
И командир со спущенными штанами подошел к окну.
- Да, действительно, нет прыща! Вот Ваши деньги, товарищ командир.
- Что, лейтенант, на месяц без кабака остался?
- Никак нет, товарищ командир. Видите снаружи толпа? Я с каждым на зарплату поспорил, что заставлю Вас жопу в окно показать...
- Ну, пиздец тебе, лейтенант! Я тебя в такую глушь сошлю - волком выть будешь. К тому же там командир - мой однокурсник, я его предупрежу, что ты ушлый. Всё, лейтенант, иди, собирай вещички!
Прибывает лейтенант в другую часть, идёт к тамошнему командиру представляться.
- А, это про тебя мне говорили! Ну, заходи, заходи. Мне тут сказали, что ты просто пиздец, какой ушлый. Так вот, лейтенант, со мной такие номера не пройдут!
- Я понял, товарищ командир. Только если я засуну Вам в жопу морковку, то обратно выну уже огурец!
- Это как же?
- Да вот так! Засуну морковку, а обратно выну огурец!
- С чего это морковка в жопе в огурец-то превратится?
- Не верите? Хотите, на Вашу зарплату поспорим?
- Да хоть на пять!
- Договорились! У меня вот и морковка с собой!
Командир снимает штаны, а лейтенант засовывает ему в жопу здоровенную морковку. Командир кряхтит, морщится, но терпит. Шутка ли - пять зарплат!
- Ну что там, лейтенант? Давай уже, вынимай!
Лейтенант вынимает обратно... Естественно, морковку!!!
Командир ликует:
- Ну, что, пацан? Я же тебя предупреждал, что со мной шутки плохи! Погоди-ка, другу позвоню, расскажу, как я тебя сделал!
Звонит.
- Слушай, сделал я твоего ушлого! Он мне теперь пять зарплат торчит!
В ответ раздается стон:
- Бляяяяяя...
- Ты чего?!
- Да этот гадёныш, уезжая, на десять зарплат со мной поспорил, что в первый же день морковку тебе в жопу засунет…'''
,'''Идёт Штирлиц по лесу, вдруг перед ним выходит волк и начинает рычать. Штирлиц сунул руку в карман и подумал: "это конец". "Так, а где же пистолет?"'''
,'''Захотіли москалі стати українцями. Прийшли вони в одне українське село, в хату де жив старий, самотній дід і питають: 
- Дед как нам стать украинцами? 
Дід: 
- Бачите он ту високу гору? 
Москалі: - Да, вижу.. 
Дід: 
-А на ній високий камінь бачите? 
Москалі: 
- Да.. 
Дід: 
- Залізьте не цей камінь і крикніть "Я УКРАЇНЕЦЬ", і станете українцями. 
Вилізли вони на ту гору і бачать що разом на камінь не вилізуть, і один каже: 
- Давай ты меня подсадишь,а я вылезу и дам тебе руку и крикнем. 
Підсадив він його, той виліз і кричить: 
- Я УКРАЇНЕЦЬ!!!! 
Другий каже: 
- Давай мне руку. 
- Та пішов ти нахуй, москаль йобаний.'''
,'''Волк поймал колобка, крутит его в лапах, вертит: 
- Куда тебя ебать??? Куда тебя ебать??? 
- Не надо меня ебать! 
- ОТКУДА ТЫ ЭТО СКАЗАЛ??!! ОТКУДА ТЫ ЭТО СКАЗАЛ???!!'''
,'''Мужик смертельно заболел. Пошел на болото топиться, Только 
приготовился вдруг лягушка выныревает: 
- Что надо? Что пришёл? 
- Да болен я, жить мне полгода осталось. Зачем семью буду мучать, 
. утоплюсь да и всё 
- Иди мужик домой, всё будет хорошо. 
Приходит мужик домой, а его жена втречает: 
- Милый, с больницы звонили, все хорошо, твои анализы нормальные, 
. ИХ просто перепутали 
Прошло полгода. У мужика завал, зарплату полгода не платят, Под 
сокращение попадает, семья бедствует. Пошел на болото. Лягушка: 
- Что надо? Что пришел? 
- Да неадоело все. Зарплату не платят, семью не могу содержать, топлюсь. 
-. Иди мужик домой, Все Будет Хорошо 
Приходит мужик На Работу, а его все приветствуеют, премию выписали, 
. задолженность отдали, повысили оклад, Должность новую Дали 
Прошло полгода. Жена загуляла, дети школу прогуливают, 
отца ни кто не слушает. Пошел на болото. 
- Что надо? Что пришел? 
- Ай лягушка, устал. Не мешай, утоплюсь и дело с концом. 
-. Иди мужик домой, Все Будет Хорошо 
Приходит мужик Домой а, там дети "папа-папочка" лезут целоваться, 
обниматься. Жена на коленках прошения молит, ноги целует. 
Ну мужик думает "Блин лягушку-то отблагодарить надо". Пошел на болото. 
- Что надо? Что пришел? 
- Да добра ты мне столько сделала, давай отблагодарю. 
- Да иди домой. Все хорошо. Иди. 
- Да не могу я так, совесть не позволяет. 
- Ну ладно, хочешь мне добро сделать, так трахни меня. 
... - И тут, вы не представляете товарищ следователь, лягушка превращается в 12-летнего мальчика!'''
,'''Закончился всемирный потоп. Ковчег причаливает к Арарату, и Ной начинает оттуда выгружать клетки с медведями, собаками, тиграми, львами и другими животными. 
А на горе армяне сидят и в нарды играют. Один другого в бок толкает и говорит: 
- Ара, смотри, цирк приехал!'''
,'''Открывает Ньютон закон всемирного тяготения, а там армяне сидят и в нарды играют.'''
,'''Чертил студент дипломный чертёж на А1 неделю сутки напролёт, в итоге доделал всё, откинулся на стуле и так мечтательно протянул:
- Ээээх! Сейчас бы поебаться.
Тут в комнату залетает фея и спрашивает:
-Привет, студент. Поебаться хочешь?
Ну тот, разумеется, воодушевлённо кивает, соглашается. А фея ХУЯК! чернильницу на чертёж опрокидывает и говорит, смеясь и улетая:
- Ну ебись.'''
,'''Слепой заходит в магазин, берет собаку-поводыря и начинает раскручивать её над головой. 
— Мужчина, что вы делаете?!!
— Да так, осматриваюсь…'''
,'''Стоит Фридрих Ницше у прилавка и думает: "Какую половину рябчика взять: переднюю или заднюю? Вроде бы хочется отождествить акт поедания птичьей плоти с зарождением мира, с началом чего-то прекрасного, а с другой стороны, в задней части есть вкусные ноги, хотя это закат и омрачение. А может, вдоль его разрезать?"

Озадаченного учёного заметил продавец и поспешил поинтересоваться, о чём тот задумался. Ницше поделился своей бедой, на что продавец ему ответил:
- Ваша теория стройна. Она отражает объективную реальность и согласовывается с современными взглядами философов, однако истинная суть мироздания состоит в том, что рябчиков по частям мы не продаём.'''
,'''В капиталистическом мире человек эксплуатирует человека, а в социалистическом — наоборот'''
,'''Ранее утро в типичной деревне нечерноземья.
Просыпается глава семьи, выходит на порог избушки/хаты, почесал яйцо, потянулся, заглушил сушняк, испив студенной колодезной водицы, сходил в туалет и пошел в хлев.
Заходит в хлев, а там корова, Буренка, опора и кормилица, мертвая лежит.
Запечалился глава семьи, чем теперь семью кормить?
Где теперь детям молока достать и теленочка ведь ждали.
Погоревал и не нашел другого выхода, кроме как повеситься.
Подумал - сделал.
Взял веревку, привязал к балке, стал ногами на ясла и соскользнул вниз.
Подергался, подергался и помер.
Проходит время.
Просыпается жена главы семьи.
Вышла на порог, потянулась, огляделась - мужа нигде нет.
Подошла к колодцу, умылась студеной водицей.
Зовет мужа - не отзывается. Идёт в хлев.
Видит - висит муж, глава семьи, надежда и защита.
И корова, Буренка, кормилица и опора дохлая лежит.
Запричитала, закричала, что ж делать то теперь, как жить то дальше.
Подумала, подумала и следом за мужем на ясла залезла, батог повязала вокруг шеи лебединой, мужа поцеловала и соскользнула вниз.
Так и повисли они рядом, а под ними корова дохлая.
Прошло время, проснулся старший сын главы семьи.
Вышел на порог, закурил папироску, покурил.
Матушки нет, батюшки нет, стол не накрыт.
Сходит в туалет, выглянул на улицу, заглянул в спальню родительскую, во льху поискал, в конце концов в хлев заходит и видит.
Висит батюшка, висит матушка, да еще и ворова сдохла непонятно от чего.
Поговоревал старшый сын, пригорюнился, взял наковальню, взял цепь, привязал к шее и пошел на реку топиться.

Приходит на реку, а там русалочка по воде круги наматывает, чешуей блестит, глазками сверкает, срам свой совсем не прикрывает.
Спрашивает русалочка у старшего сына:
- отчего так невесел?
- та вот, батюшка и матушка повесились, корова сдохла, как жить дальше - ума не приложу.
- а хочешь, чтобы всё было, как раньше? И батюшка жив и матушка и корова ваша. И всё будет хорошо.
- конечно хочу, а что я должен для этого сделать?
- должен ты для этого трахнуть меня, да не просто, а так, чтобы я 3 раза кончила.
Задумался старший сын, да, видимо, терять нечего.
- согласен.
Снял наковальню, спустился в воду, прелюбодеят они, прелюбодеят, время идёт, силы уже на исходе у молодца, а русалка ненасытная только раз и кончила.
Устал старший сын, не может более, вылазит на берег.
- и что теперь делать, русалка?
- делай то, зачем пришел. Условие моё ты не выполнил.
Делать нечего - нацепил снова наковальню и прыгнул в воду.
Пузыри уж перестали идти и только ноги над водой, как поплавки торчат - неглубоко в нечерноземных реках.
Прошло время, проснулся средний сын.
Вышел в сени, молока кислого испил, за льох сходил, давай искать родителей.
Ходил, искал, в хлеву нашел.
Висит папенька, висит маменька, коровка дохлая лежит.
Заплакал средний сын, пошел старшего брата искать.
Искал, звал, кричал - нигде нет.
Пошел к реке.
Смотрит - сапоги брата старшего из-под воды торчат и русалка вокруг них кружится, плещется, хвостом виляет, длинными косами старшего брата обвивает.
Молвит русалочка к среднему сыну.
- что пригорюнился, молодец?
- та вот, папенька да маменька в хлеву повесились и коровка наша померла, да и брат мой старший, как я вижу утопился.
- а хочешь, чтобы брат твой ожил и родители и Бурёнка ваша?
- знамо дело - хочу. А что от меня нужно?
- а всё просто. Тебе нужно сделать так, чтобы я кончила хотя бы 2 раза - и всё вернется.
Подумал средний брат. Опыта в этом деле то нет, но и выхода то нет.
Прыгнул в воду и вставил в русалку.
Молод был средний брат, да горяч, по нраву пришлась молодость, да скор оказался средний сын.
Хоть и кончила русалка один раз, да быстро отстрелялся молодец.
Вылез он на берег, нашел камень, снял ремень, камень обвязал, да и к брату старшему прыгнул.
Плавают они уж вдвоем, ноги к верху, как поплавки...
Прошло время, уж солнце высокого стоит, уж и птицы петь устали и попрятались в тени, как проснулся младший сын.
Вышел он во двор, никого нет.
Покурил, водицей сушняк заглушил, россолу еще выпил, жрать охота.
Пошел искать предков, да нет нигде их.
Нашел в хлеву.
Во попал.
Предки откинулись и корова сдохла.
Пошел искать старших братьев.
Приходит к реке.
Вон они - плавают вверх ногами и русалка вокруг них крутится, улыбается юноше, заигрывающе спину выгибает.
- что безрадостен так, мальчик мой хороший?
- так а чему тут радоваться? Предки повесились, братья утопились, корова сдохла еще.
- а хочешь их вернуть? Всех.
- ясен пень, делать чего?
Посмотрела русалка на юношу глазками шаловливыми, мал еще, думает.
- а нужно тебе сделать так, чтобы я кончила.
- тю. И всё?
- и всё.
Задумался младший сын и спрашивает.
- а, если ты кончишь 2 раза - что будет?
- ну, я тебе еще мороженого дам ящик, любишь мороженое?
- ясен пень. А что будет, если ты 3 раза кончишь?
Русалка аж возбудилась.
- дам 100 рублей к мороженому в придачу.
- ахренеть. А за 4 раза что будет?
- за 4 раза - сделаю так, что ты, когда вырастешь, станешь секретарем райкома комсомола, как тебе такое?
- зашибись, круто. А 5 раз?
- ну за это секретарем партии, идёт?
- ясен пень. А за 10 раз?
- ну такого уж быть не может, но, коли осчастливишь меня 10 раз - быть тебе самым влиятельным и богатым человеком в мире, когда вырастешь, а до того момента тебе почестей, что Гагарину будет.
Ухмыльнулся младший сын.
- а тебе не поплохеет, как Буренке после 10-ти то?'''
,'''один человек спросил у мудреца, что важнее: любить или быть любимым? 
мудрец ответил: "какая гусеница для танка важнее: правая или левая?" 
— правая. 
— охуеть ты инженер. как танк поедет на одной гусенице? как он поедет-то блять? ты дурак что ли? иди нахуй отсюда.'''
,'''Филолог приходит на работу с огромным синяком под глазом. Начальник его спрашивает: — Ну как же так? Вы же интеллигентнейший человек! Откуда же это у Вас? — Да Вы понимаете... Пили чай у одной милейшей особы. В числе приглашенных был один военный. Вот он начал рассказывать: — "Был у меня в роте один хуй... "
А я ему говорю: — Извините, но правильно говорить не в роте, а во рту.'''
,'''У Падди была одна очень неприятная проблема, его хер в длину был больше 25 дюймов (а это больше 60 см!), так что ни одна женщина не хотела с ним спать. Бедный Падди извёлся и пошёл ко врачу с просьбой как-то уменьшить ему член. Врач сказал, что ничего поделать не может, но есть способ разобраться с проблемой без медицины. Нужно пойти в лес, найти лепрекона и предложить ему руку и сердце. Каждый раз когда лепрекон скажет "нет" член будет укорачиваться на 5 дюймов. И вот Падди пошёл в лес и обнаружил лепрекона, рыбачащего у пруда. Падди подходит и говорит:
-Лепрекон, выходи за меня!
-Нет!
Падди смотрит в штаны и... О ЧУДО! Член и вправду стал на 5 дюймов короче. Но всё равно большой и Падди продолжает:
-Леперкон, подумай ещё раз, может, всё-таки выйдешь?
-Да ты заебал, нет!
Падди смотрит в штаны. 15 дюймов, хотелось бы ещё на пяток поменьше и он продолжает:
-Ну подумай ещё, может всё-таки выйдешь, ну пожалуйста
Лепрекон не выдерживает, вскакивает и орёт:
-Как же ты меня заебал! Сколько можно повторять: Нет, нет, нет и еще раз нет!'''
,'''Великая Отечественная. Захватывают немцы глухую русскую деревню, выстроили всех и командир говорит:
— Всех мужчин мы расстреляем, но у женщин есть возможность спасти своих мужей. Мы выстроим мужиков в ряд, снимем им штаны, вам завяжем глаза, а вы по хую должны определить, кто ваш муж
Делать нечего, бабы согласно закивали. Построили мужиков, спустили штаны, первая пошла.
— Так этот не мой, это не мой, это не мой, о вот он мой!
Следующая:
— Этот не мой, этот не мой, о вот он мой! 
Так несколько баб прошло, командир думает:"Не так дело не пойдет, мы же никого не расстреляем!" Решили поставить между русскими несколько немецких солдат. Поставили. Пошла следующая:
— Так, этот не мой, этот не мой, этот не мой, этот вообще не с нашей деревни.'''
,'''Едет монашка с проституткой в одном купе. На путане норковая шуба, изумруды в ушах, брильянтовое колье на шее.
- Скажите, а сколько стоит ваша шуба? – робко интересуется монашка.
- Одну ночь любви.
- А изумрудные сережки?
- Две ночи любви.
- …
- Если вы хотите спросить о колье, то мне оно досталось после недели, проведенной на Багамах с богатым лохом.
Вернулась грустная монашка к себе в монастырь, заперлась в келье. Стук в дверь.
- Кто это?
- Отец Георгий, пусти…
- Шли бы вы, батюшка, нахуй со своими карамельками!'''
,'''Уже не смешно, но мне похуй.

В самолете мужчине стало плохо. Стюардесса бегает по салону и ищет врача, все молчат.
Веган: Я веган.'''
,'''Едет машина скорой помощи, внутри водитель, врач, фельдшей, медсестра и студент практикант. Едут, вдруг водитель резко тормозит и начинает задыхаться. Хватается руками за горло, шипит - ужасное зрелище. Медсестра невозмутимо и твердо хватает чемоданчик с препаратами и бьет водителя по голове. Тот моментально успокаивается и машина продолжает движение. Тут фельдшер хватается за горло, падает на пол, начинает задыхаться и сипеть. Медсестра зло бьет фельдшера по голове и тот сразу оправляется и садится на место. Не прошло и минуты, как врач начинает задыхаться и брыкаться на полу. Медсестра резким ударом чемоданчика приводит врача в чувства. Обалдевший от увиденного студент спрашивает у врача:
- Я учусь только на 4 курсе и все мои знания - это сплошная теория, но о подобных симптомах я даже не слышал! А метод лечения настолько странный, что я окончательно растерян, не могли бы вы мне объяснить..
Врач, махая рукой:
- А, не бери в голову. У медсестры муж вчера повесился, мы ее подъебываем'''
,'''Поверка в армии :
- Сидоров 
- Я
- Попов 
- Я
- Иванов 
- Я
- Три тысячи тридцатый 
*Молчание*
- Три тысячи тридцатый, твою мать!!
Тут голос из строя : 
- Тауариш лэйтенант, я нэ трех тысящи трисатый, я Зозо'''
,'''Брат заглядывает в комнату сестры, а она голая перед зеркалом крутится, себя разглядывает везде и приговаривает: 
- Эх, мужика бы, мужика! 
На следующий день заглядывает к ней в комнату, а там десять голых мужиков ебут её. 
Он ахуевший несётся в свою комнату, раздевается догола и перед зеркалом рассматривает себя везде и приговаривает: 
- Эх, велосипед бы, скоростной блядь, скоростной!'''
,'''Чувак работал проводником в поезде. Однажды, в купе сидит
блондинка.
Чувак: — Ваш билетик!
Блондинка: — Ой! Он выпал в окно!
Чувак выкидывает блондинку из поезда на ходу и она разбивается.
Чувака приговаривают к электрическому стулу.
Последнее желание: Хочу скушать банан! Скушал.
Включают рубильник — нифига! Второй раз включают — жив!
По закону положено помиловать. Чувака отпускают.
Он снова устраивается работать в поезд проводником.
В купе сидит мальчик.
Чувак: — Ваш билетик!
Мальчик: — Ой! А я его проглотил!
Чувак выкидывает мальчика на ходу — тот разбивается. Суд.
Приговор к электростулу. Последнее желание скушать банан.
Тщательно проверяют, чтобы он не обматывал руки шкурками от
банана, включают рубильник — нифига. Еще раз включают — опять
нифига. Отпускают. Чувак снова устраивается работать в поезд
проводником. На этот раз он выкидывает священника, который
забыл купить билет. Суд. Приговор к электростулу. Скушанный
банан. Чувака осматривают, стул проверяют еще на двух
заключенных — все работает. Врубают раз — чувак жив. Еще раз —
снова жив. Отпуская, спрашивают:
— Ну как это удается — что за сила в этих бананах?
Чувак:
— Я не знаю. Я просто очень люблю бананы. А остаюсь живым…
ну, наверное, потому, что я — плохой проводник!..'''
,'''Мужчина привез жену в роддом, трудные роды, сидит у кабинета час, другой, третий. Наконец, распахивается дверь, выходит сияющий врач, на руках у него малютка, врач снимает маску и радостно смотрит на мужика и вдруг берет младенца за ногу и со всей силы бьет об стенку, что аж мозги вылетели. Мужик в шоке.
Врач: 
-Ха, наебал, мертвеньким родился'''
,'''Сидит король со своими друзьями из других стран и говорит:
— Вот моя дочка мужа себе нашла, только я имя забыл...... Странное какое-то.... то ли э-эээээ, граф Пидарас..... Эээээ-м, то ли герцог Гомосек... Да как же его, это...... ну.......
Посидели несколько минут:
— О, вспомнил! Сергей!'''
,'''Купается мужик. Вдруг хватает его кто-то за яйца и голос спрашивает:
- Плюс два или минус два?
Мужик говорит:
- Плюс два.
Вылезает на берег, а у него четыре яйца. Думает мужик: сейчас вернусь,
скажу "Минус два" и все опять будет хорошо. Полез он обратно в воду, доплыл до того места, там его опять хватают за яйца и спрашивают:
- Плюс четыре или минус четыре?
- Ну плюс четыре
Выходит, а у него весит уже целая горсть из восьми яиц, ну что делать опять пошёл, ему снова голос
- Плюс восемь или минус восемь?
Ну мужик не захотел отдавать всё и говорит плюс. Еле выходит, подходит к жене, стоять тяжело, ну жена говорит:
- У нас трое детей, мы счастливы в браке, говори минус.
Заходит мужик, ему вопрос:
- Плюс 32 или минус 32?
- А вот хрен тебе, минус
Ну и выпали у него все 32 зуба'''
,'''В основе было аж два раза, лол

—Алло, здравствуйте! Тут неподалёку, вперемежку с птичьим клёкотом и ненавязчивым шёпотом ветра, будто озаряя багрянцем зеленеющие волны берёзовой рощи, обдавая жаром словно летнее солнце в разгар знойного душного июльского лета, испуская лёгкую дымку подобно поднимающемуся туману от раскинувшейся глади озера на рассвете, распугивая лесных обитателей - работящих бобров, мудрых ежей и беззаботных свиристелей, догорает дом-музей Пришвина. Нет, высылать пожарных теперь уже не нужно.'''
,'''Морозным зимним вечером прогуливался Владимир Ильич по Москве и встретил маленькую девочку. Девочка горько плакала.
- Что же ты плачешь, девочка? - спросил Ильич.
- Мама мне дала копеечку на хлебушек, а я ее потеряла...
Пожалел Ленин девочку, дал ей копеечку, а она все равно горько плачет.
- Что же ты теперь-то плачешь, девочка? - опять спросил Ильич.
- А вот если бы я не потеряла копеечку, то было бы у меня сейчас две копеечки...
Не понравилась Ильичу буржуазная сущность девочки. Отнял он у нее копеечку, а заодно и пальто, и шапочку.'''
,'''Женщина решила покончить жизнь самоубийством.
Она стоит на краю высокого моста, собирается прыгнуть.
Подходит бомж и говорит:
- Вы же все равно хотите покончить жизнь самоубийством, может сексом займемся?
- Отвали!
- Ну ладно, ладно... Внизу подожду…'''
,'''В почти пустой автобус заходит хиппи и, увидев симпатичную молодую монашку, предлагает ей трахнуться. Монашка, конечно, краснеет и выходит из автобуса на следующей же остановке. Тогда водитель автобуса говорит хиппи:
— Я скажу тебе, как эту монашку поиметь. Каждую ночь она приходит в длинной рясе на городское кладбище молиться Богу. Ты надень маску, иди на кладбище, подожди, пока она не обратится к Богу, потом выйди и скажи, что ты Бог. Ну, хиппи пошел на следующую ночь на городское кладбище, смотрит — идет монашка в длинной рясе с капюшоном. Подождал он, пока она молитву закончит, потом выходит в маске и говорит:
— Я Бог. Отдай мне твое тело!
Монашка отвечает:
— Ладно, только, пожалуйста, трахни меня в жопу, потому что я не хочу терять невинность.
Хиппи сделал свое дело, снимает маску и, смеясь в лицо монашке, говорит:
— Ха-ха-ха, я не Бог, я хиппи!
А монашка, снимая капюшон, отвечает:
— Ха-ха-ха, а я не монашка, я водитель автобуса!'''
,'''Едут в купе четверо - мама с дочкой лет 16, прапорщик и рядовой. Заезжает поезд в тоннель и раздается звук такой смачной пощечины. Мама думает:
— Надо же, какая дочь молодец. Такая молодая, а уже мужчинам отпор умеет дать.
Дочь думает:
— Надо же, какая мама у меня молодец. Столько лет без мужика, а все равно не позволяет просто так приставать. 
Прапор думает:
— Надо же, несправедливость какая. Рядовой пристает, а я огребаю.
Рядовой думает:
— В следующий раз в тоннель заедем, я опять ему ёбну.'''
,'''— Милый, я хочу, чтобы мы умерли в один день! 
— Дед, как же ты заебал!'''
,'''Мать собирает портфель сыну в школу.
— Вот, я тебе тут положила хлеба, колбасы и килограмм ржавых гвоздей.
— Зачем?
— Ну как зачем? Вот ты в школе проголодаешься, хлеб возьмешь, колбасу на него положишь и поешь.
— А гвозди?
— Да вот же, положила!'''
,'''Бабка на старости лет решила застрелиться. А где точно сердце находится — не знает. Приходит она к врачу, он ей и отвечает:
- Сердце находится на 2 пальца ниже соска. Вернулась домой, взяла пистолет, выстрелила... Прибыла скорая. 
Кто-то из прохожих спрашивает:
- Что случилось-то?
- Да бабка себе колено прострелила!'''
,'''Сидит грузин на базаре, торгует апельсинами. Подходит к нему девушка в короткой юбке и таким нежным голосом говорит:
— А сколько у вас стоят апельсины?
Грузин:
— Дэсят рублэй кылограм.
Она, задирая юбку выше:
— А так? 
Он, опуская руку под прилавок:
— Восэм рублэй.
Она поднимает юбку еще выше, грузин: «шэст рублэй», она поднимает еще выше, он: «тры рубля», она поднимает еще выше... Грузин, вынимая руку из-под прилавка и вытирая ее об тряпку:
— Дэсят рублэй кылограм.'''
,'''— Папа, знакомься, это Александр.
— Проходите, Александр, отобедайте с нами!
— Папа, Александр сыт.
— Что вы, Александр, не ссыте, проходите.'''
,'''Дай человеку жареного мяса и он будет сыт один день. Дай человеку имя Сыт и он будет Сыт всегда.'''
,'''В школе идёт урок труда у девочек 5-го класса. Учительница начинает:
- Сегодня у нас непростая тема: "Выворачивание канта наизнанку".
Тут одна из учениц тянет руку.
- Ну что такое, Сидорова? Опять у тебя какой-то вопрос?
- Да, Мариванна. Это что же такое получается: нравственный закон над головой, а звёздное небо внутри нас?'''
,'''Проходит конкурс кто больше надрочит. Выступают американец, русский и украинец.
Американец просит литровую бутылку и уходит в комнату. Возвращается - надрочил пол-литра.
Русский просит пятилитрушку и уходит. Возвращается - надрочил 3 литра.
Украинец просит ведро и уходит в комнату на день. На следующий день возвращается и говорит: 
- бля, я условия конкурса забыл, но на всякий случай насрал целое ведро.'''
,'''Играют Каспаров с Крамником в шахматы. У Каспарова позиция уже совсем плохая, но сдаваться не охота. Вот он смотрит в окошко и видит там какую-то собачку. Каспаров:
— Слышь, Володь, чья это собачка бегает?
Крамник:
— Ничья.
Каспаров:
— Согласен.'''
,'''Игорь попал в глубокую яму и чудом из нее вылез. 
"Чудес не бывает", — подумал Игорь и залез обратно.'''
,'''Подходит жених к ребе: 
— Сколько я вам должен за церемонию? Ребе: 
— Лично мне ничего… Но, если так хотите, пожертвуйте столько денег, во сколько вы оцениваете красоту вашей жены. 
Жених подумал, заглянул под фату и достал из кармана один шекель. Ребе подумал, заглянул под фату, вздохнул и достал сдачу.'''
,'''— Садись, дочка, рассказывай. Как к своему парню съездила? Много гуляли?
— Я постою.'''
,'''По территории воинской части мчится прапорщик с тележкой, полной дерьма. Его останавливает капитан:
- Стой! Что спиздил?
- Ничего.
- Не верю, - капитан запускает руки в дерьмо и шарит там. Ничего не найдя, отпускает прапорщика. Прапорщик несется дальше. Навстречу ему майор:
- Стой! Что спиздил?
- Ничего.
- Не верю, - майор запускает руки в дерьмо и шарит там, но также ничего не находит. Прапорщик мчится дальше. Навстречу ему полковник:
- Стой! Что спиздил?
- Ничего.
- Я те дам ничего, - полковник запускает руки в дерьмо и шарит там, но тоже ничего не находит. Наконец прапорщик выбегает за ворота части,оглядывается, вываливает из тачки дерьмо и злобно ворчит:
-Что спиздил - что спиздил... Тележку спиздил!'''
,'''Два еврея сильно поругались. Через пару дней Изя проходит мимо дома Мойши, и, увидев его в окне, восклицает:
— Ой, вей! Ви только посмотрите - он высунул свою мерзкую рожу в окно! Лучше бы жопу высунул - и то красивее было бы!
— Я таки высовывал, но все сразу начали спрашивать: "А шо у Вас делает Изя, вы же, вроде, поругались?!"'''
,'''Сидят под забором алконавты, пьют метиловый спирт. Разлили по первой, хряпнули, тут один говорит: "Дима, разливай еще скорей, чё-то на улице быстро темнеет".'''
,'''Муравей таскает камешки, веточки, строит дом. Подъезжает стрекоза на кабриолете:
— Что делаешь?
— Дом строю.
— А зачем?
— Ну, зима придет, холодно будет, а я в домике согреюсь.
— Ну ладно, строй, а я в ночной клуб поеду. И уехала.
Муравьишка тащит камень и думает: "Ну ладно. Придет зима — посмотрим..."
Наступила зима. Муравьишка пилит дрова, подъезжает стрекоза вся в мехах:
— Что делаешь?
— Дровишки пилю, холодно, сейчас печку затоплю и согреюсь.
— Да, холодно. А я в аэропорт еду, полечу в Рио–де–Жанейро, там богема вся собирается, художники, писатели, с ними и перезимую.
— А Крылов будет?
— Конечно будет, все собираются.
— Ну, увидишь — передай, что я его маму ебал.'''
,'''Встретил вчера бывшего одноклассника. В общем, в школе он был толстым — пиздец! Жрал постоянно булки всякие. Ну и прозвали его Пашка-пузырь.
Не виделись лет 10, где-то только слышал, что он после школы в тренажерку стал ходить, качаться неистово, просушился — все дела.
Так вот. Иду около дома, смотрю – машина в сугробе застряла. Водитель и так и сяк – ни в какую. И тут подходит какой-то парень, здоровенный — ну мамонт просто! Приподнимает «шестерку» сзади и она благополучно катится вперед.
Потом захожу в булочную – бааа! А там Пашка-пузырь! Жирный, как черт. Стоит, булку жрет.'''
,'''На лекции по линейной алгебре. Препод что–то пишет на доске. На последней парте студенты играют в карты. Один из них что–то не так покрыл и второй на всю аудиторию:
— Ты что, совсем охуел?!
Препод:
— Спокойно! Сейчас все объясню.'''
,'''тудент отвечает на экзамене, фейлится по полной, думает вот-вот на пересдачу отправят, и говорит профессору:
- Профессор, а давайте я за тройку сейчас одной рукой эту парту сломаю?
- Но это невозможно... ладно, давайте.
Студент размахивается и ударяет по парте, она трескается пополам. Профессор:
- Хмм, впечатляет. Ладно, тройку поставлю...
- Подождите, а давайте я за четвёрку головой стену пробью?
- Ну... давайте.
Студент со всей дури бьёт головой о стену, и пробивает её насквозь. Профессор:
- Ну так и быть, ставлю четыре...
- Подождите, а давайте я за пятёрку на вас одеколоном нассу?
- Ну... давайте.
Студент расстёгивает ширинку и обоссыввает профессора. Тот принюхивается:
- Да это же обычная моча!
- Ну ладно, ладно, ставьте четыре.'''
,'''Два ковбоя увидели объявление: «Принимаем скальпы индейцев. Один скальп — 100$». Не долго думая, ковбои на коней — и в прерию. Скачут, скачут — нигде нет индейцев. Наконец, на ночь глядя, заметили одного индейца, пристрелили его, скальп сняли, затем поставили палатку и заночевали. Утром просыпается один из ковбоев, выходит из палатки и видит: вокруг в боевой раскраске стоит толпа индейцев, все в полной боевой готовности, луки наготове, томагавки подняты. Ковбой сразу же ныряет и в палатку и будит товарища: 
— Джо, вставай! Джо, мы богаты!'''
,'''На парижском аэродроме к пилоту подходят два еврея: 
— Послушайте! Вы сейчас в Лондон летите. Возьмите нас. 
— А вы — кто такие?
— Так себе, обыкновенные евреи.
— О-о, евреи! Ни за что не возьму. Евреи — такой эмоциональный народ: начнут кричать, за плечи хватать — ещё катастрофа будет.
— Но мы не будем кричать, ей-Богу! Абраша, правда, не будем?
— Ей-Богу, говорит Абраша,— не будем!
— Ну, я вас возьму, с условием: за каждое сказанное слово —вы платите 1 фунт стерлингов! Согласны?
— Абраша, ты согласен? 
— Согласен!
Сели. Полетели. Прилетели в Лондон, пилот спустился, слез, мотор осматривает. Подходит к нему один из пассажиров: 
— Теперь уже можно разговаривать?
— Теперь можно.
— Абраша в воду упал!'''
,'''идит Мухаммед на корточках в Амстердаме и плюет на землю через дырку в зубах. Вдруг появляется фея и говорит:
— Я социалистическая социальная либеральная фея! Я прилетела, чтобы исполнить три желания!
— Посмотри, какая у меня дырка во рту! Я хочу, чтобы мне вылечили и вставили все зубы!
Не успел Мухаммед произнести эти слова, как тотчас вышел закон о бесплатном лечении и протезировании зубов для социальных иностранцев, и его рот засиял белоснежной голливудской улыбкой.
— Я очень скучаю по своим четырем женам и пятнадцати детишкам, а также по родителям, братьям и сестрам, родителям-братьям-сестрам моих жен! Я хочу, чтобы мы все жили на роскошной вилле, и чтобы денег всегда много было!
Не успел Мухаммед договорить, как оказался в прекрасной вилле! На столе — текст закона о воссоединении семей для социальных иностранцев, а также банковские распечатки со сведениями о поступивших пособиях. Дом полностью меблирован и оснащен электроприборами в соответствии с законом о помощи в приобретении мебели и бытовой техники для социальных иностранцев.
Счастливый Мухаммед просто не знает, чего бы ему еще попросить, ведь одно желание еще осталось. И он попросил:
— Хочу стать настоящим голландцем. Не только по гражданству. Хочу быть голубоглазым блондином, и чтоб меня звали Ян Дейк!
Не успел он закончить фразу, как все исчезло, и он обнаружил себя вновь сидящим на корточках и плюющим на землю сквозь дырку в зубах.
— Что случилось? — спросил он у феи.
— Как не стыдно, господин Дейк, клянчить у государства! Вы должны заботиться о себе сами! Идите и ищите работу!'''
,'''Встречаются в саванне два мужика, один телефонную будку за собой тащит,
другой с рельсой наперевес. Второй спрашивает первого:
- А ты чё с будкой?
- А я если хищника увижу забираюсь в будку, он походит вокруг
меня и уходит...
А ты чё с рельсой?
- А я вижу лев за мной бежит, я от него. Вижу догоняет!
Я рельсу бросаю и дальше налегке.'''
,'''В бар забегает мужик, подбегает к стойке и говорит бармену:
— Давай, наливай быстрее, пока не началось.
Бармен наливает, мужик выпивает.
— Давай еще наливай, быстрее, быстрее, пока не началось.
Бармен наливает, мужик выпивает.
— Давай, давай, не спи, наливай еще, пока не началось.
— Мужчина, вы платить то собираетесь?
— Ну вот, блять, начинается.'''
,'''Бабка с дедом решили поебаться. Что ни делали, у деда не встал! Ну он и говорит: 
— Как встанет, крикну: "Бабка!" вставай сразу раком и спускай штаны! 
Ну прошло несколько дней! Бабка в огороде копается, и тут дед несётся и орёт:
— Бабка, бабка! 
Та, думает: "Ну, видать, встал". И раком нагнулась, штаны спустила! Дед подбегает и пенделя ей: 
— Тебе лишь бы ебаться, пизда старая, у нас сарай горит!'''
,'''двокат: раз процесс, два процесс — завтра будет "Мерседес".
Врач: раз аборт, два аборт — завтра еду на курорт.
Учитель: раз тетрадь, два тетрадь — есть чем жопу вытирать.'''
,'''Однажды ты спросишь меня, что для меня на первом месте: ты или программирование?
Я отвечу тебе, что программирование.
И ты уйдёшь, так и не узнав, что ты для меня на нулевом месте.'''
,'''— Изя, а шо, правда, шо ты бандитам отдал все золото и деньги?
— Таки да... Они вставили мне в зад паяльник, а на пузо утюг, и подключили к току!
— И ты сразу отдал?
— А шо, ждать пока за свет накрутит?'''
,'''Один мальчик родился с гайкой вместо пупка.
И он спросил у родителей, почему у него там гайка. Родители пообещали ему рассказать об этом на его 14-летие.
Ему исполнилось 14. И он опять подошёл и спросил у родителей, почему у него вместо пупка гайка. Родители пообещали рассказать ему об этом когда ему будет 18 лет.
В 18 лет он спросил снова и родители рассказали ему, что есть один остров на котором растет пальма, а под этой пальмой зарыт сундук.
Парень долго копил денег и всё-таки приехал на этот остров. Нашёл пальму, откопал сундук, в котором лежал гаечный ключ. Он открутил гайку ключом и у него отвалилась Жопа.'''
,'''Зачем французскому танку зеркала заднего вида? Чтобы лучше видеть поле боя.
'''
,'''Одному безработному актёру звонит друг и говорит:
- Слушай, тут халтурка подвернулась, я сразу о тебе подумал.
Актёр:
- Конечно, какой разговор, - типа, по гроб жизни благодарен, совсем на мели. - А что за роль?
- Да понимаешь, не очень большая. Одна строчка.
- Одна строчка? Нет проблем, - типа, ну совсем бабок не осталось,
ничем не брезгует. - А какая?
- "Чу! Я слышу пушек гром."
- "Чу, я слышу пушек гром?" Годится! Куда идти?
- В среду подойдёшь в Малый, спросишь режиссёра такого-то.
- Замётано.

В среду актёр подходит в Малый, находит режиссёра, тот: скажите строчку, актёр с пафосом произносит:
- Чу! Я слышу пушек гром!
- Отлично, - говорит режиссёр. - Роль ваша. Приходите в субботу к 7 вечера на спектакль.
- Понял! - отвечает радостный актёр.

Ясное дело, от такого удачного поворота судьбы актёр запивает по чёрному. Приходит в себя в субботу где-то в 6:30 и сломя голову бросается в театр, всю дорогу повторяя "Чу! Я слышу пушек гром".
У театра его останавливает швейцар: ты, мол, куда без билета?
- Я "Чу! Я слышу пушек гром", - объясняет актёр.
- А! Ты "Чу! Я слышу пушек гром", - успокаивается швейцар, - ну проходи.
Актёр - за кулисы. Его, ясное дело, не пускают.
- Я "Чу! Я слышу пушек гром!", - кричит актёр.
- Ты "Чу! Я слышу пушек гром"? Опаздываешь! Давай срочно в
гримёрную! - кричат ему в ответ.
Он - в гримёрную. Гримёрша:
- Товарищ, вы кто?
- Я "Чу! Я слышу пушек гром."
- Вы "Чу! Я слышу пушек гром"? Что же вы опаздываете?! Садитесь
вот тут, сейчас я вас быстренько.
Актёр, уже в гриме и в мыле, подбегает к сцене. Его перехватывет режиссёр.
- Ты "Чу! Я слышу пушек гром"?
- Я "Чу! Я слышу пушек гром"!
- Чуть не опоздал! Давай, твой выход!
Актёр выходит на сцену, и за спиной у него раздаётся оглушительный взрыв. Актёр вздрагивает и орёт:
- ДА ВЫ ЧТО ТАМ, СОВСЕМ ОХУЕЛИ??!!!'''
,'''Умирает Барак Обама.
Через 10 лет ему становится скучно, и он просит Бога отпустить его на Землю проведать, как поживает его страна. Бог отпускает. Заходит Обама в Нью-Йорке в бар, заказывает пиво и спрашивает бармена, как страна поживает, как развивается, какие проблемы решает. Бармен удивлённо:
— Какие проблемы могут быть? Мы же Великая империя, всё кругом наше.
— Как наше? А Ирак, Афганистан?
— Да уже всё наше!
— А Европа, Африка, Ближний Восток?
Бармен достаёт из-под стойки глобус и гордо крутит его:
— Я же говорю: мы — империя, весь мир принадлежит нам!
Обама, радостный, гордый и довольный, допивает пиво и говорит:
— Ну, спасибо, друг! Сколько с меня?
Бармен:
— Одна гривна.'''
,'''Улица. У магазина стоит коляска. Голос из коляски:
- Ну бля, обоссался! Ну пиздец, еще и обосрался!
Идет мимо мужчина и говорит:
- Мальчик ты еще маленький, ходить не умеешь, а уже матом ругаешься.
- Дядя, а ты ходить умеешь?
- Умею.
- Ну вот и пиздуй отсюдова.'''
,'''Пpиехал деpевенский мyжик домой из гоpода. Его дpyзья спpашивают: 
- Hy чо тама видал, в ГОРОДЕ ? 
- Cалют видал. 
- А чо эт такое ? 
- Hy как вам объяснить... Hy сначала нет ни хуя, потом хуяк, хуяк, хуяк - еб твою мать, и опять ни хуя. Чо ж ты, Мань, плачешь-то ? 
Маня: 
- А как же не плакать-то, кpасотища-то какая.'''
,'''У них не было детей. Они купили овчарку и безумно любили её. через 7 лет у них родился сын... Однажды из детской выбежал пёс, его морда была в крови. Жена взвыла, муж достал ружье и убил пса. войдя в детскую, они увидели спящего сына, а возле кроватки убитую змею… 
Через 7 лет у них родился сын... Однажды из детской выбежал отец, его морда была в крови. Змея взвыла, сын достал жену и убил детскую. Войдя в кроватку, они увидели спящее ружьё и убитого пса… 
Через 7 псов у них родилась змея... Однажды из отца выбежал пёс, его детская была в жене. Кроватка взвыла, ружьё достало сына и убило 7 лет. Войдя в овчарку, они увидели, что через 7 лет у них родилась жена.'''
,'''У одного человека испортился водопровод. Пришел к нему водопроводчик - молодой пацан, только после ПТУ... А y хозяина дочка была - красавица. Она водопроводчику и шепнула:
- Будет батя вина заморские наливать - не пей. Деньги будет сулить - не бери. А проси y него гвоздик ржавый... С собой носи и счастье тебе будет!...
Прифигел парниша, но так и сделал: починил водопровод, от бутылки и от денег отказался, гвоздик взял и ушел. А хозяин дочку обнял и говорит:
- Молодец, Анечка! Здорово мы его наебали!'''
,'''Сын еврейки и негра подходит к отцу и спрашивает: 
— Пап, я негр или еврей? 
— А в чём дело, сын? 
— Соседский пацан продаёт велосипед за $20, думаю сторговать мне его за $10 или спиздить?'''
,'''Сидит мужик на даче. Хорошо… Смотрит — на дереве яблоко висит. Красивое, наливное.
Сорвал, сел на скамеечку. А кругом — лепота… "Дай", — думает, — "съем яблочко…"
Тут вдруг земля затряслась, задрожала, налетели тучи, гром, шум, пыль, порывы ветра. Земля прямо перед ногами мужика разрывается пополам, из невероятно глубокого разлома вылезает огромная Жопа, заглатывает яблоко, скрывается под землю. И все проходит, разлом исчезает сам собой, тучи улетают, снова светит солнце, птицы поют, пыль рассеивается, мужик в ступоре:
— Что это было?....
Тут опять земля раскалывается, шум, пыль, грохот — вылазит Жопа и говорит мужику:
— Антоновка.'''
,'''Великий философ Фридрих Ницше был добрый и веселый человек.
Один раз он пошел в магазин за хлебом.
Толстая продавщица на хлебном отделе очень любила издеваться над добрым и веселым философом. Ницше терпеть ее не мог и часто называл тупой пиздой.
— Ну что, Ницше, — сказала толстая продавщица, завидев Фридриха. — За хлебом небось прискакал? Любишь хлебушек-то?
— Обожаю, — сдержанно ответил Ницше.
— А ты его пёк, чтобы вот так его жрать? — вкрадчиво спросила вдруг продавщица. — Ты вообще когда-нибудь пёк хлеб? А, Ницше?
— Я? Пёк хлеб? — переспросил Ницше.
— Ты в уши долбишься, Ницше?
— Нет, — сказал Ницше. — На оба вопроса — нет.
Великий философ умел быть лаконичным.
— Вот испеки сначала, а там поговорим, — триумфально закончила продавщица.
— Секундочку, — сказал Ницше. — Если я буду печь хлеб, то нахуя мне тогда, тупая ты пизда, покупать его у тебя?
— Меня, Ницше, твои запарки совершенно не ебут — спокойно парировала продавщица. — Делать мне больше нехуй, как вместе с тобой философствовать. Муку тебе продам. А хлеба — во, — продавщица показала мозолистый кукиш, для убедительности схватив себя за локоть.
Ницше задумался.
— А ты-то, — наконец произнес он, — ты-то сама хлеб пекла?
— Пекла, голубчик, пекла, — сказала продавщица. — Да я столько его выпекла, что ты бы всю жизнь ел, да еще и детям бы твоим осталось.
— У меня нет детей, — сообщил Ницше.
— Это пиздец какой-то, — сказала продавщица. — Детей у него нет, хлеб он печь не умеет и не хочет, а только и знает, что честных продавщиц заебывать.
— Это ты честная продавщица, что ли? — заинтересовался Ницше. — Да у тебя ебало как у Муссолини. У честных людей лица другие.
— А что Муссолини? Чем тебе теперь Муссолини не угодил? Да он, если хочешь знать, тоже хлеб пёк. Эх ты, Ницше.
Ницше неуверенно потоптался на месте.
— Ладно, хуй с ним — махнул он рукой. — Давай сюда свою муку.
— Запомни, Ницше: культура — это лишь тоненькая хлебная корочка над раскаленным хаосом, — довольно сказала продавщица. — Крепко запомни.
— Запомню, — сказал Ницше с ненавистью. — Крепко запомню.
На следующий день Ницше пришёл в тот же магазин.
— Чего тебе? — спросила продавщица.
— Муки давай, сквозь зубы ответил Ницше.
— Что, научился печь?
— Тебя, суку, забыл спросить. Давай муки.
— За такую грубость могу и скалкой по ебальнику… — промямлила продавщица.
— Давай муку, говорю.
Продавщица подала муку.
— А теперь жри.
— Что жрать?
— Муку жри.
— С какого перепугу? Сам жри.
— Я сказал жри, сказал Ницще и опустил продавщицу мордой в муку. — Что, нравится?
Продавщица покорно съела муку и посмотрела на философа испуганными глазами.
— Приятно, да? А я вчера целый вечер это говно жрал.
Ницше так и не научился печь хлеб.'''
,'''Английский король Ричард Львиное Сердце был высоким, сильным мужчиной. Он очень гордился своей силой и любил показывать людям, как силён он был. Однажды, когда он проезжал на лошади по сельской местности, его конь потерял подкову. К счастью, он находился неподалёку от деревни и вскоре был найден кузнец. «Дай мне хорошую подкову», — сказал Ричард мужчине. Подкову дали. Ричард взял её в руки и разломал надвое. «Эта подкова не очень хорошая, — сказал он, — дай мне получше». Кузнец не сказал ни слова. Ему дали другую подкову, но и её Ричард разломал. Кузнец дал третью подкову. На этот раз Ричард был удовлетворён и приказал кузнецу подковать его лошадь. После того, как работа была сделана, Ричард предложил мужчине монету. Кузнец взял монету между пальцев и разломал её надвое. Теперь настала очередь Ричарда удивляться. Он достал из кармана монету большего размера и протянул её кузнецу. Мужчина разломал её, говоря: «Эта монета не очень хороша, дай мне получше». А Ричард ему: «Пошел нахуй отсюдова!!»'''
,'''Скачет Илья Муромец по пустыне, устал, силы на исходе, видит вдали оазис, вода и еда, и там же Змей Горыныч сидит. Илья Муромец достал свой меч и в бой с Змей Горынычем, бьётся два дня и две ночи с ним в жестоком бою, на третий день Змей Горыныч спрашивает у Богатыря, да что ж тебе надо от меня?
— Да пить я хочу!!!!!!
— Да пей, хули ты доебался-то?!'''
,'''Затеял мужик капитальный ремонт и нанял под это дело двух рабочих - вроде нормальные, не бухают. Приезжает через две недели домой принимать работу, ходит - ну просто заебись всё сделано, не придерешься. Заходит в туалет, а там унитаз блять к потолку прихуячен! Он, естественно: это чё за хуйня? А работяга ему: эй, погоди ругаться, вот смотри! - разбегается, отталкивается от стены, хватается за края унитаза руками, подтягивает к нему свою жопу и начинает срать. Моча с говном, естественно, валятся сквозь ноги вниз, падают ему на спину, грудь и лицо, он отпускает руки, шлёпается в кучу собственного говна и говорит:
- Действительно, Вася, хуёво сделали - надо подправить'''
,'''Взяли пираты судно на абордаж, всю команду повязали, а капитану говорят, мол, показывай давай чего везешь. Ну кэп пожал плечами, говорит - пойдёмте. Спускаются вниз, а весь здоровенный трюм совершенно пуст, только одинокая свинья сидит посередине и хрюкает. Пираты охуели, ходят вокруг свиньи - ничего особенного, самая обычная, еще и воняет пиздец. Говорят капитану: - Ты ебанутый штоле? Нахуя свинью тут держишь, ее и на мясо-то посреди океана не пустишь, она жрёт только? 
Капитан плечами стоит пожимает. Пираты махнули на него рукой, повытаскивали у команды с карманов что было ценного, и отчалили.
А капитан спустился в трюм, штаны снял, ебёт свинью и приговаривает:
- Во дураки! Свинья - охуенная тема!'''
,'''Стоят школьники за школой и курят. Подходит к ним учитель и спрашивает: 
—Так, а ну-ка признавайтесь, из какого вы класса!
— Буржуазия.'''
,'''Передача на радио. Позвонившим предлагают назвать слово, которого нет в словаре, но которое в предложении может иметь смысл. Итак, звонок. 
Ведущий: здраствуйте, вы кто? 
- Я Дэйв. 
- Ваше слово? 
- Шолб. По буквам: Ш-О-Л-Б. 
- Такого слова в словаре нет. У вас все шансы выиграть путевку. Теперь скажите осмысленное предлложение с этим словом. 
- Шолб ты на хуй! 
Телефонный звонок моментально обрывают. Далее передача продолжается, проходит несколько неудачных разговоров со звонящими. И вот очередной звонок. 
Ведущий: Алло. Как вас зовут? 
- Джефф. 
- Ваше слово? 
- Эцново. Э-Ц-Н-О-В-О. 
- Да, странное слово, в словаре нет. А предложение целиком? 
- Эцново я. Шолб ты на хуй!!!'''
,'''Как-то я забыл про это боянище
Созвал царь американца, немца и русского и говорит:
— Кто море говна на своей машине переедет, тому дочку в жёны и полцарства в придачу.
Американец на Форде до середины доехал — утонул. Немец на БМВ 2/3 проехал — утонул. А русский говорит:
— Почему ты вообще нами командуешь? Ты какой страны царь? Как получилось, что американец и немец одновременно должны тебя слушать? А что твой народ скажет, если ты полцарства отдашь человеку, который просто проедет по говну на машине? Пиздец, ты вообще, блядь, как царём стал?'''
,'''В цирке конферансье объявляет номер: 
— Мальчик с феноменальной памятью!! Встречайте!!
Все радуются, аплодируют. На арену выходит очкарик.
Конферансье: 
— Сейчас этот вундеркинд обоссыт всех сидящих в первом ряду!!
Сидящие в первом ряду срываются с мест и бегут занимать места в других рядах.
Конферансье:
— Разбегаться бесполезно, у мальчика феноменальная память.'''
,'''Приходит советский разведчик в парижское бистро, заказывает чашку чая, сидит, пьет. Тут подбегает к нему официант и говорит:
- О! Мсье русский шпион!
Ну, наш, понятно, сконфужен, как ты, спрашивает он официанта, узнал, что я - шпион?! 
- О, мсье положил сахару в чашку, размешал ложечкой, да так с
ложечкой в стакане и пьет!
Ну, в следующий раз чекист, умудренный опытом, заказал чаю, положил сахару, размешал, а ложечку так аккуратненько об край стряхнул, сидит и пьет чай без ложки. Тут опять к нему подскакивает официант:
-О, говорит, а мсье - русский шпион! 
- Ну что за дела???!! Как ты, шельма, узнал? 
- О, мсье положил сахару в чашку, размешал ложечкой, так аккуратненько ложечку вытащил, взял чашку, а большим пальцем как будто ложку придерживает!... 
Ну, в другой раз приходит чекист, отточенными движениями вытаскивает ложку, берет чашку так изысканно двумя пальцами, мизинец оттопыря, пьет, значит, чай, как вдруг опять официант: 
- О, мсье - русский шпион! 
Ну, чекист звереет, как ты, говорит, теперь-то догадался???!! 
А официант ему отвечает:
- Ты, блядь, дебил сука, 3 раз сюда уже приходишь, я, блядь тя запомнил уже на ебало, дебил ёбаный! ТЫ БЛЯДЬ ПО-РУССКИ СО МНОЙ ГОВОРИШЬ!!!!!! ТЫ ВКУРСЕ БЛЯДЬ, ЧТО У ТЕБЯ ИЗ-ЗА ПАЗУХИ БУТЫЛКА ВОДКИ, БЛЯ! ТЫ, БЛЯДЬ, В ВАЛЕНКАХ!!!'''
,'''Однажды мудрец сидел у городских ворот. К нему подошел юноша и спросил: 
— Я ни разу не был здесь. Скажи, старик, какие люди живут в этом городе?
Старик ответил ему вопросом: 
— А какие люди были в том городе, из которого ты ушел?
— Это были эгоистичные и злые люди. Впрочем, именно поэтому я с радостью уехал оттуда. 
— Здесь ты встретишь точно таких же, - ответил ему старик. 
Немного погодя, другой человек приблизился к этому месту и задал тот же вопрос: 
— Я только что приехал. Скажи, отец, какие люди живут в этом городе? Старик ответил тем же:
— А скажи, сынок, как вели себя люди в том городе, откуда ты пришел? 
— О, это были добрые, гостеприимные и благородные души! У меня там осталось много друзей, и мне было нелегко с ними расставаться. 
— Ты найдешь таких же и здесь, - ответил старик. 
За всей этой сценой наблюдал горожанин, возившийся рядом со своей телегой. Он подошел к старику и спросил: 
— Почему ты одному сказал, что здесь живут негодяи, а другому - что здесь живут хорошие люди? 
— А тебя ебёт что ли? Хули ты, блять, подслушивал?!
— Но...
— Говно! Хули ты, сука, подслушивал, пидорас, блять?!
— Простите...
— Завтра, сука, чтоб в 12 дня в центре города со своими пацанами был, иначе пиздец тебе.'''
,'''Едут два ковбоя по прерии. Вдруг видят - говно на дороге лежит.
Один другому и говорит:
— Слушай, Джо. Давай ты прямо сейчас съешь это говно, а я дам тебе 100$?
— Замётано, Билл, - отвечает Джо и с жадностью съедает говно. Билл даёт ему 100$, едут дальше. Вдруг — опять на дороге говно. Джо стало обидно за себя и он говорит:
— Билл, спорим, что ты не съешь вот это говно койота даже за 100$?
— Запросто, - сказал Билл и съел говно, за что тут же получил 100$. Едут дальше. Но Билл что-то загрустил.
— Ты чего невесел, Билл? - спрашивает его Джо.
— Да ты знаешь, Джо, меня не оставляет ощущение, что мы с тобой только что бесплатно наелись говна.'''
,'''Один еврейский мальчик очень любил читать. Он читал всё, что попадалось ему под руку, и обожал ходить в свой любимый книжный магазин. Однажды он понял, что прочёл уже всё, что там продавалось. Мальчик спросил хозяина, есть ли в магазине что-нибудь, чего он никогда не видел. Хозяин сказал, что есть, и достал книгу под названием "Смерть". Он охотно продал её со скидкой, всего за 10 шекелей.

Однако он предупредил мальчика, чтобы тот никогда не открывал первую страницу. Мальчик вернулся домой, прочитал книгу и остался доволен. Но ему всегда хотелось узнать, что же там, на первой странице. Однажды искушение стало слишком сильным, и он пролистал книгу к самому началу, и уронил её в УЖАСЕ.
На первой странице было написано: "Рекомендуемая цена - 5 шекелей"'''
,'''Умирает старый богатый корсиканец. Собралась семья, ждут, кого же старик объявит наследником. По старой доброй корсиканской традиции все должен унаследовать самый ленивый. Умирающий слабым голосом:
— Доминик, сын мой, подойди ко мне. Доминик подходит.
— Сынок, представь, что ты сидишь и видишь, как ветер гонит купюру в 500 франков. Что ты сделаешь?
— Не сдвинусь с места, папа. Зачем мне лишний раз утомляться?
— Золотые слова, мой мальчик. Ступай. Паоло, подойди. Подходит Паоло.
— Паоло, обнаженная страстная красавица тянет к тебе руки. Что ты сделаешь?
— Не пошевелюсь. К чему напрягаться лишний раз?
— Прекрасный ответ, сынок. Ступай. Антонио, подойди.
— Сам подойди.'''
,'''Василий Иванович с Петькой сидят, скучают:
- Петька, сгоняй на хутор к старику-самогонщику, сообрази чего-нибудь!
- Это можно.
Через час Петька возвращается.
- Ну как?
- Да нет у него ни фига.
- Эх, молодежь, всему вас учить надо. Пойдем вместе.
Приходят к деду. Василий Иванович:
- Здорово, отец!
- Здорово, сынки!
- Мы вот к тебе от имени Советской власти. Вот я гляжу, хата у тебя старая.
- Ох, какая старая!
- Петька, запиши: новую хату ему от Советской власти! И жена у тебя вроде старая.
- Ой, какая старая!
- Петька, запиши: новую жену ему от Советской власти!
- Сынки! Родненькие! Да сколько ж я вас ждал!
Сели за стол, выпили, с собой взяли. Уже в дверях Василий Иванович как бы невзначай:
- Слышь, дед! А может у тебя и хуй старый?
- Уж какой старый!
- Петька, запиши: хуй ему от Советской власти!'''
,'''Мать послала сына на базар продать петуха. Пацан взял петуха, приходит на рынок и первой попавшейся тётке говорит:
- Тёть, купи петуха!
- Сколько?
- Двадцать пять!
Ну та посмотрела, видит, петух ничё так и отвечает:
- Ну ладно, только у меня сейчас денег с собой нет, пойдём ко мне домой, там я тебе заплачу.
Пришли они к ней домой, та дала ему денег, вдруг звонок в дверь. Она говорит:
- Слушай, это мой муж пришёл, а ты всё-таки почти мужчина, он может неправильно понять, короче, полезай в шкаф.
Пацан залез в шкаф, тётка открывает дверь - а там любовник. Ну она, ессесно, про парня забыла, пошла заниматься любовью. Через некоторое время опять звонок в дверь, та любовнику:
- Чёрт, теперь точно муж, давай быстро в шкаф!
Любовник залез в шкаф, пришел действительно муж. Тут парень любовнику шепчет:
- Дядь, купи петуха.
- Да иди ты, на хрен он мне сдался!
- Дядь, купи петуха, а то закричу!
Ну, делать нечего, заплатил мужик, стоит с петухом, а пацан снова шепчет:
- Дядь, отдай петуха!
- Ты чего, охренел, я же только что у тебя его купил!
- Дядь, отдай петуха, а то закричу! 
Что делать, пришлось отдать. Пацан снова:
- Дядь, купи петуха.
Так продолжалось, пока не ушёл муж. Парень приходит с петухом домой, половину денег матери, половину себе. Приходит отец, а мальчик ему в шутку:
- Пап, купи петуха!
- Пошёл на хуй, в шкафу заебал!'''
,'''В салоне шикарного корабля бал. Вдруг с мрачным лицом входит капитан.
-У меня для вас две новости: плохая и хорошая
-Сначала хорошую! - требуют пассажиры
-Мы получим одиннадцать оскаров.'''
,'''Америка. Парикмахерская. Парикмахер стрижёт клиента.
— Какие планы на отпуск, старина? — спрашивает он у него.
— Хочу побывать в Москве, — отвечает тот.
— В Москве!!! В этом грязном, вонючем городе, где мусор не убирают и по улице ходят бандиты и медведи! Да вы что, сэр?! Не вздумайте!!!
— И всё–таки я поеду. Ведь мои дедушка и бабушка когда–то жили там!
— А какими авиалиниями летите? — спрашивает парикмахер.
— Аэрофлотом! — отвечает тот.
— Мама дорогая, это самые поганые авиалинии. Там воняет керосином, ужасная теснота и отвратительная еда. Пару часов опоздания вам гарантировано.
— И всё–таки я еду!
— Ну ладно, а в какой гостинице вы остановитесь в Москве?
— В “России”!
— Какой кошмар! Там куча проституток, ломовые цены, кругом тараканы и мерзопакосный персонал.
— Я еду, в любом случае!
— А что же вы будете делать в Москве? — не унимается парикмахер.
— Хочу сходить в Мавзолей Ленина!
—??????. Там же огромная очередь, кругом милиция и шмон. Мерзко и противно!
— Меня ничто не остановит! — отвечает клиент.

Через пару месяцев, после поездки он снова приходит в парикмахерскую.
— Привет, дружище, — говорит парикмахер, — как поездка? Правду ли я вам говорил про Москву?
— Знаете, Москва мне очень понравилась. У них новый мэр и он навёл там порядок. Кругом чистота, криминала мало и медведей я не видел!
— Ну, а Аэрофлот как? Всё, как я сказал?
— Не совсем. Самолет был почти пустой, так что нас пересадили в первый класс. Кормили отменно и стюардесса была очень милой и симпатичной девушкой.
— Ну, а гостиница, правда, дрянь?!
— Что вы! Они там недавно сделали ремонт и была неделя скидок, так что я жил в номере люкс! Никаких проституток и тараканов.
— Ну, а Ленина–то видели? — не унимается парикмахер.
— Представьте себе, видел. И вы даже не поверите. Стою я в очереди, вдруг подходит человек в штатском, отводит меня в сторону и говорит, что их учёные только что совершили чудо и смогли оживить Ленина, и что он хочет поговорить с кем–нибудь из толпы. И они выбрали меня для этой цели.
— Боже, ушам своим не верю! И что же Ленин вам сказал?
— Да всего пару слов: “Батенька, и кто же это вас так хуёво постриг?”'''
,'''Приходит мужчина к врачу.
- Доктор, у меня последнее время что-то вкуса нет. Доктор обращается к медсестре:
- Дайте больному семнадцатую пробирку. Больной попробовал.
- Это же говно. Врач:
- Все в порядке, правильно. Вкус появился.
Проходит несколько дней. Этот же мужчина опять приходит к врачу.
- Доктор, вкус-то у меня появился, но вот теперь памяти не стало. Доктор обращается к медсестре:
- Дайте больному семнадцатую пробирку.
- Так там же говно, - говорит мужчина.
- Все в порядке. Вот и память вернулась.'''
,'''Попадают на остров с людоедами китаец, француз и русский.
Людоеды их повязали и говорят: "У вас сейчас два пути. 1 — мы вас сжираем заживо. 2 — находите ведро ягод, мы вам даем задание, если задание выполняете — отпускаем".
Побежали бедолаги искать ягоды. Первый прибегает француз с ведром слив, туземцы ему говорят, вот задание: запихни все ягоды из ведра в жопу, если издашь хоть один звук, мы тебя убьем. Ну француз тужится, запихивает ягодки, на последней сливе от боли вскрикнул — туземцы его сразу и убили.
Прибегает русский с ведром малины, туземцы дают ему то же задание, он давай запихивать малину, а малина хорошо идет, мягко, а он вдруг на последней как заржал — туземцы его сразу и убили.
На небесах встречаются француз и русский, француз: "Слышь, русский, ты чего заржал-то, малина-то мягкая, хорошо шла, выжить мог ведь?", а русский отвечает: "Да я увидел как китаец арбузы несет "'''
,'''Под утро, за игрой в покер, умер старый еврей. Остальные игроки думают, как бы сообщить его жене печальную новость? Как самого деликатного, выбрали Абрама. Абрам приходит домой к усопшему и говорит его жене:
— Здавствуйте, Софочка.
— Здравствуй, Абрам.
— Софочка, знаете, Ваш Мойша вчера заглянул ко мне, мы поиграли в покер, и он таки проиграл очень много денег…
— Да чтоб он сдох!!!
— Таки уже…'''
,'''Поймали три брата золотую рыбку. Она взмолилась:
– Отпустите меня, добры молодцы, и тогда исполню каждому по три любых желания. 
Посовещались братья и решили рыбку отпустить. 
Молвит старший брат:
– Хочу мешок золота. 
Молвит средний:
– И я хочу мешок золота. 
Младший же брат говорит:
– А я хочу, чтобы рука тряслась!
Посмотрели все на него, как на дурачка, но ничего не сказали. Загадывают дальше. Старший и средний пожелали для себя кареты резные, позолоченные от крыши до колёс, какие во всём королевстве не сыщешь, а младший опять чудит:
– Хочу, – говорит, – чтобы нога тряслась!
Переглянулись братья. "Ну, – думают, – точно спятил". 
Загадывают последнее желание. Старший захотел сделаться сильным, как лев, а средний попросил ещё два мешка золота, потому как жаден был до денег. А младший и говорит:
– Хочу, чтобы голова тряслась!
Исполнила рыбка их желания. 
Возвращаются молодцы домой. Старший и средний радуются, предвкушают, как будут жить они в роскоши, как не будет в их жизни горести, а младший идёт, трясётся и думает:
– бля чёт хуйню загадал)))'''
,'''Заходят как-то в бар филолог, лингвист и педагог. 
А бармен им:
–Мы бомжей не обслуживаем!'''
,'''Англичанин, француз и русский хвалятся своими женами.
— Когда моя жена катается верхом, - говорит англичанин, - ее ноги достают до земли. Не потому, что лошадь низкорослая, а потому, что у моей жены длинные ноги!
— Я свою жену обнимаю за талию двумя пальцами одной руки, - говорит француз, - не потому, что у меня большая рука, а потому, что у моей жены узкая талия!
— Перед уходом на работу, - говорит русский, - я хлопаю свою жену по заднице, а когда возвращаюсь с работы, она у нее еще трясется. Не потому, что у моей жены задница дряблая, а потому, что у нас в СССР самый короткий в мире рабочий день!'''
,'''Я хожу в спортзал, и моя девушка чувствует себя со мной под защитой, ведь если на нас нападут, я могу присесть 3 подхода по 12 повторений.'''
,'''Two men come into a bar. The first man says, "I will drink H2O, please". The second man says, "I will drink H2O, too".
The second man dies.'''
,'''Сидят два немецких офицера в бункере. Вдруг звонит телефон, один берет трубку:
— Алло! Да мой фюрер! Да мой фюрер! Да мой фюрер! — и кладет трубку.
Второй спрашивает:
— Кто звонил?
— Звонил мой фюрер. Спрашивал: "Я твой фюрер? Я твой фюрер? Я твой фюрер?"'''
,'''— С вас 250 рублей. Пакет нужен?
— Будете так шутить, я к вам больше стричься не приду.'''
,'''Звонит телефон в расположении казармы военной части. Мимо идет солдат — думает — чего надрывается, дай возьму трубку:
— Алё…
Из трубки:
— Скажите пожалуйста, сколько у Вас в части служебных Волг?
— Две: одна в ремонте, на другой ездит старый мудак Пилипов.
— А кто это такой — Пилипов?
— А, это наш командир части — полковник Пилипов.
— И чё, мудак он что ли?
— Да, таких мудаков ещё поискать надо — мудак–мудаком!
— Да, а Вы знаете с кем Вы разговариваете?
— Нет.
— Вы разговариваете с полковником Пилиповым!
— Да, а Вы знаете с кем Вы разговариваете?
— Нет.
— Ну тогда до свидания — старый мудак Пилипов!'''
,'''Возле дома просветленного Горного Даоса приземлилась серебристая летающая тарелка. Шлюз медленно открылся. Яркий белый свет залил лужайку у дома.
Из света показалась неестественно тощая и высокая фигура.
Рауати Ксентари, достойный сын расы Ксентари, вошел в дом Даоса и прямо с порога спросил:
— Что ты отдашь мне взамен на все тайны строения Вселенной?
Мудрец сидел профилем к своему гостю и созерцал стоящее перед ним жестяное ведро. Не поворачиваясь к пришельцу он спокойно произнес:
— Вот это ведро с говном.
Инопланетянин крепко задумался.
— Но почему? — наконец спросил он. Мудрец медленно повернулся к гостю и строго посмотрел в его огромные темные глаза.
— Потому что в доме Горного Даоса, — отчетливо процедил он сквозь сжатые зубы, — не место ведру с говном!
В тот же вечер Рауати Ксентари стал его учеником.'''
,'''Сидят пятеро ковбоев в баре, пьют виски, курят сигары, тут открывается дверь, входит весь побитый мужик и говорит:
- Бегите все отсюда, сюда Черный Джек идет!
Ну ковбои на него посмотрели, и думают: "Да, он один, а нас пятеро... пох"
Через 15 мин вбегают еще двое, все в крови:
- Бегите, сюда Черный Джек идет!
- Та пох, он один, а нас пятеро!
Еще через 20 мин вбегают четверо, изуродованные, в крови, некоторые с поломанными руками:
- Мужики бегите, сюда Черный Джек идет!
Ковбои задумались, решили валить... Тут открывается дверь, заходит мужик весь в черном, в черном плаще, в черной шляпе, в черных перчатках, в черных сапогах, подходит к одному мужику и злым голосом говорит:
- Сосать!!!
Ковбой с перепугу начал сосать... Тут мужик говорит:
- Давай быстрее, а то там Черный Джек идет!'''
,'''Салун где-то на западе Америки. У шеста-девушка в нижнем белье, в зале-группа интуристов. Вдруг встаёт один из них, вскидывает револьвер, стреляет. У танцовщицы рвётся бретелька лифчика,стреляющий удовлетворённо заявляет, хвастаясь меткостью:"Я-Джек Лоуренс из Йорка, Англия!", все аплодируют. 

Встаёт 2-ой турист, вскидывает свой наган,стреляет, лопается 2-ая бретелька. Стрелявший:"Франсуа Жерон из Нормандии, Франция!". Девушка довольна, возбуждена, танцует дальше, кругом хлопают в ладоши. Резко поднимается 3-й турист, достаёт обрез, нажимает на спуск, девушка падает вся в крови. "Мыкола Парасюк Львовщина, Захидна Украина!"'''
,'''Крутой джазовый бар проводит конкурс на лучшего исполнителя, которого возьмут на работу. Собирается толпа музыкантов и среди них старый негр.
Выходит и говорит: 
— Эта песня называется "Я буду дрочить на тебя всю ночь!" 
Играет восхитительный блюз, после которого половина музыкантов сразу собираются и уходят, другие просто плачут от восторга! 
Старый негр говорит: 
— А следующая моя песня называется "Соси у меня, сука, пока я не кончу!!!" 
И играет блюз еще круче от которого оставшиеся музыканты единогласно отказываются от участия в конкурсе. 
Влдаделец заведения говорит 
— Мы вас берем, только не могли бы вы не называть своих песен, а они немного… ммм.. шокируют. 
Негр соглашается. 
Идет очередной концерт, главный исполнитель видимо забыл заправиться, у него член торчит из штанов, он садится за за рояль, играет. Хозяин заведения замечает эту оплошность, подходит к нему, говорит: 
— У тебя хуй торчит наружу, знаешь?" 
Негр 
— Что? Знаю ли я её?! Да я её написал!'''
,'''Попали в племя к людоедам русский, пидор и хохол. Чтобы выбраться с острова, людоеды им ставят условия на выбор или:
1. 30.000 долларов
2. Анальный секс со всем племенем
3. Съесть мешок соли
Русский без разговоров отдал деньги, ему выдали байдарку и он уплыл.
Пидор говорит: "Ну, мне не привыкать, ебите!". После чего ему дали байдарку и он уплыл.
Хохол говорит: "Тащите мешок соли!" Съел половину, больше не может. Говорит: "Ладно, бубукайте меня." Прошла через него половина племени, хохол больше не может: "Давайте соли." Съел еще немного, кричит: "Не, лучше ебите!" Пропустил через себя еще несколько человек и говорит: "Ну ладно, ладно, развели вы меня на деньги."'''
,'''Едут в поезде японец, кавказец и русский. Японцу позвонили на мобильник, он поговорил немного и выкинул его в окно. Все сразу загалдели: "Ты чего, дурак?".
Японец: "Да у меня этого говна в стране навалом!".
Кавказец достал арбуз, отрезал кусочек, съел и выкинул арбуз. Все сразу загалдели: "Ты чего, с ума сошёл?".
Кавказец: "Да у меня в стране этого говна навалом!".
Русский молча взял кавказца и выкинул его из окна.'''
,'''Встречаются русский владец диснейленда и американский. Решили сравнить у кого страшнее комната страха.
Русский заходит в американский там мумии, скелеты всякие, в общем, всё как обычно.
Заходит американец в русский: длинный коридор без света, идет, идет американец страшно ему уже, долго идет. Увидел свет. Идет дальше, видит сидит грузин со свечкой.
Грузин американца спрашивает:
- ты попу мыл?
- мыл
Грузин гасит свечку'''
,'''Семья Лордов 18-е столетие. На дворе был праздник и вся прислуга была отпущена домой.
Лорд, его жена и 2 дочери поужинали, а посуду мыть некому. короче решили они провести игру молчанку: "Кто скажет слово — тот пойдет мыть посуду". 

В общем, сидят за столом, играют. Тут пришел к ним в гости жених старшей дочери, а они сидят молчат. Не долго думая он взял свою невесту уволок наверх и сделал с нею то, что хотел сделать в первую брачную ночь. Спустился, усадил ее на место — смотрит на них — дальше молчат. 

Теперь поднялся с младшей дочерью — сделал с нею то, что хотел сделать в течении 1-го года совместной жизни с ее сестрой. 

Потом сделал то, что вообще делать не хотел с женой лорда. 

Довольный жених собирался уже уходить, но вспомнил что у его кареты колеса скрипят. Так вот заходит он в столовую и кричит: "У ВАС ВАЗЕЛИНА НЕТУ?"

"НЕТ" — ответил лорд 
"ПИДОРА ОТВЕТ" — ловко парировал молодой жених. И выебал лорда в жопу так, что у того аж парик в салатницу упал.'''
,'''На советский завод приезжает американская делегация. Идут по цеху и видят: стоят возле станка мастер и рабочий. 

Переводчицу попросили перевести. 
Та, слегка смущаясь, переводит:

- Мастер говорит рабочему: 
«Кто-то вступил в интимные отношения с твоей матерью, ты, гулящая женщина, даже эту изнасилованную шестеренку, гулящая женщина, не можешь, гулящая женщина, правильно сделать, гулящая женщина. 
Директор, гулящая женщина, даст тебе хороший женский половой орган, гулящая женщина, и вступит с тобой в интимные отношения посредством заднепроходного отверстия, гулящая женщина, если из-за тебя, пассивного гомосексуалиста, опять сорвется на половой член план, гулящая женщина, который должен выполнить завод!» 

В ответ на это рабочий отвечает, что рабочий уже вступил в интимные отношения с речевыми органами директора, что рабочий вступил в интимные отношения со всеми на заводе шестеренками и, что самое невероятное: 
он вращал на половом члене завод со всеми его планами!'''
,'''Разговаривают второклассница и первоклассница.
Второклассница:
- Прикинь, Вася из 5го "Б" сегодня утром Маше из 3го "А" в вестибюле куннилингус делал!
Первоклассница:
- Ничего себе! А что такое вестибюль?'''
,'''Бесконечное число математиков заходит в
бар. Первый заказывает одно пиво. второй - половину кружки, третий - четверть, четвёртый - одну восьмую...
Бармен не выдерживает:
- Знаю я вас, пидоров, вам две кружки на всех!'''
,'''К психиатру приходит мужик, садится в кресло и говорит:
- Понимаете, доктор, у меня навязчивая идея. Я хочу кормить людей говном. Но не так, чтобы они просто его ели, а чтобы ели и просили ещё! Вы поможете мне?
- Потише, голубчик, потише. Во-первых, вы не в больнице, а в отделе кадров первого канала. Во-вторых, вы нам подходите.'''
,'''Программист идет в магазин.
Жена просит купить его булку, а если будут яйца, то десяток.
Приходит в магазин, говорит :
- У вас яйца есть?
- Есть.
- Десять булок, пожалуйста.'''
,'''Тестер программного обеспечения заходит в бар. Заказывает 1 пиво. Заказывает 0 пива. Заказывает 9999999 пив. Заказывает ящерицу. Заказывает -1 пиво. Заказывает fghfghfghfh.'''
,'''Мужик поймал Золотую рыбку. Ну и загадывает желание: чтобы все время хуй рос. Короче, живет - не нарадуется. Жизнь бьет ключом, от баб отбоя нет. Раз в год делает операцию (укорачивает). Прожил он свое и умер. Родственники поплакали, похоронили. Через год из могилы вылазит хуй. Ну неудобно как-то - срам из земли торчит - подрезали, а он через время опять... В общем родственники замахались подрезать и перезахоронили чувака хуем вниз. Проходит пять лет, на Мэнхэттэне трескается асфальт и оттуда вылазит... правильно, хуй! Его срезают, а он опять растет. Мэрия в шоке, объявляет тендер на избавление от напасти. Тендер выиграли армяне, поставив на этом месте палатку с шаурмой.'''
,'''Едут два хохла в купе. Один другому говорит:- Петро, дывысь яки чудные существа эти мухи. Так могут на стекло какнуть, шо точка малэнька- маленька. Второй:- ну и чож такого, вот я тебе на нос могу еще меньшей точкой какнуть. Да не можешь, да могу, давай поспорим. Поспорили. Один хохол приготовился, второй снял штаны и смачно сиранул другому на ебло. Та ты шо делаешь?!! - Ну извини, ну проиграл'''
,'''Сидит хохол с удочкой, рыбу ловит. Вдруг поймал 
Золотую рыбку, она и говорит:
- Отпусти меня, я любые твои три желания исполню!
- Ладно, - говорит хохол, - а нехай Монголия на Финляндию нападёт.
Поднялась тут вся Монголия, на боевой технике, на конях, кто на чём и помчались прямиком на Финляндию и захватили её.
- Давай теперь второе желание.
- Нехай теперь Финляндия на Монголию нападёт. Воспряла тут Финляндия духом, выбила монголов из своей страны и погнала их в Монголию и захватила её.
- Ну давай теперь третье, последнее желание, - говорит Золотая рыбка.
- А нехай теперь Монголия с Финляндией помирятся и пленными обменяются.
И тут помирились Монголия с Финляндией и отправились пленные каждый в свою страну.
Отпустил хохол Золотую рыбку и сидит опять, рыбачит. Через некоторое время выныривает Золотая рыбка и спрашивает хохла:
- Слушай, я никак не пойму, а зачем тебе всё это надо было? 
- А нехай они москалям всю картошку потопчут. (и засмеялся так неприятно)'''
,'''Летит тяжелый транспортный самолет в сопровождении двух истребителей. Лететь долго, и пилотам истребителей стало скучно. Ну и начали они выебываться друг перед другом: мертвые петли крутят, виражи, восьмерки. И тут в радиоэфир вклинивается пилот транспортника:
- А спорим, я сейчас сделаю то, чего вы на своих истребителях никогда не сможете.
- Ты? На своем беременном Ил-76, собрался тягаться с нами, лучшими асами страны? Ну давай, удиви нас. 

Прошло десять минут, транспортник как летел ровно, так и летит. Истребителям надоело ждать, и они вызывают пилота Ил-76:
- Ну и? Когда ты начнешь?
- Уже готово.
- И что же ты сделал того, что не можем мы?
- Сходил поссать и выпил кофе.'''
,'''- Тараканы в доме есть?
- Нет, их пауки съели.
- У Вас пауки есть?
- Нет, их крысы съели.
- У Вас крысы есть?!
- Нет, их Валентин Геннадьевич Белов съел.
- А кто это?
- Забыл представиться.'''
,'''Плывет по морю тяжелый крейсер. На мостике стоит капитан и смотрит в бинокль на водную гладь. Вдруг он замечает под водой торпеду, идущую прямо в борт. Капитан зовет боцмана: 
- Боцман, пойди в трюм и отвлеки команду, чтобы никто панику не поднял.
Боцман спускается вниз и говорит матросам:
- Спорим, что я хуем по стене ёбну и корабль развалится?
Команда соглашается. Боцман достает свой хуй, бьет им по стене. БАБАХ!!! Крейсер вдребезги. Среди обломков и человеческих тел за спасательный круг держится уцелевший боцман. К нему подплывает капитан:
- НУ, БЛЯДЬ, И УРОД ТЫ, БОЦМАН!!!ТОРПЕДА МИМО ПРОШЛА!!!!!'''
,'''К врачу приходит молодая женщина - вся в синяках и ссадинах.
Врач спрашивает:
- Господи, да где ж вас так угораздило?
- Понимаете, доктор, меня муж бьёт. Каждый раз, как возвращается с работы, так сразу, буквально с порога…
- Не волнуйтесь, у меня есть лекарство от этого. В следующий раз, когда ваш муж придет с работы, держите наготове отвар ромашки. Как только он в квартиру войдет, начинайте полоскать горло. Минут 20, не меньше.
Через пару недель женщина снова приходит к врачу цветущая и без единого синяка:
- Доктор, вы просто кудесник! Когда мой муж приходит домой, я сразу начинаю полоскать горло ромашкой. И ничего не происходит, он меня даже пальцем не трогает!
Врач, назидательно:
- Вот видите, как иногда полезно просто не пиздеть!'''
,'''Мальчика спрашивают: "какой из членов семьи для тебя самый страшный?
- "дедушкин"'''
,'''Вовочка приносит отцу дневник. Отец:
- Почему двойка по физкультуре, ты же у меня такой спортивный, подтянутый мальчик?
- Папа, учитель физкультуры мне говорит: "Подними ногу", я поднял. "Подними вторую". Я ему: "А я на хую стоять буду?", а он мне двойку.
Отец: 
- И правда на хую стоять что ли? Молодец мой мальчик, правильно сделал, мужчина!
На второй день Вовочка приносит отцу дневник. Отец:
- Почему двойка по математике, ты же у меня такой умный мальчик?
- Папа, учитель математики мне говорит: "Сколько будет два умножить на три?", Я: "Шесть". Он: "А три на два?", я: "Какая на хуй разница?", а он мне двойку в дневник.
Отец: 
- И правда, какая на хуй разница, молодец мой мальчик, правильно сделал, иди гуляй.
На третий день Вовочка приносит двойку по литературе. 
Отец:
- Вовочка, почему двойка по литературе, ты же у меня такой начитанный мальчик?
- Папа, учитель литературы мне говорит: "Сочини стишок про петушка", я сочинил: "Петушок-петушок, золотой гребешок, рано утром встает, детям спать не дает. Пидарас такой".
- И правда, сынок, пидарас петух, если спать деткам не дает, умный мальчик, иди гуляй.
На следующий день:
- Папа, меня из школы выгнали.
- Почему?
- Вызвали меня на педсовет, захожу я в учительскую, а там сидят учитель математики, физкультуры, литературы и рисования...
- Подожди, а нахуя рисования?
- Вот и я говорю им, "а нахуя учитель рисования?"'''
,'''Москва. Зима. Снег. Мальчик играет в футбол. Вдруг - звон разбитого стекла. Выбегает дворник, суровый русский дворник с метлой и гонится за мальчиком. Мальчик бежит от него и думает: "Зачем, зачем это все? Зачем весь этот имидж уличного мальчишки, весь этот футбол, все эти 
друзья? Зачем? Я уже сделал все уроки, почему я не сижу дома 
на диване и не читаю книжку моего любимого писателя Эрнеста Хемингуэя?" 
Гавана. Эрнест Хэмингуэй сидит в своем кабинете 
на загородной вилле, дописывает очередной роман и думает: "Зачем, зачем это все? Как все это надоело, эта Куба, эти пляжи, бананы, сахарный тростник, эта жара, эти кубинцы! Почему я не в Париже, не сижу со своим лучшим другом Андре Моруа в обществе двух прелестных куртизанок, попивая утренний аперитив и беседуя о смысле жизни?" 
Париж. Андре Моруа в своей спальной, поглаживая по бедру прелестную куртизанку и попивая свой утренний аперитив, думает: "Зачем, зачем это все? Как надоел этот Париж, эти грубые французы, эти тупые куртизанки, эта Эйфелева башня, с которой тебе плюют на голову! Почему я не в Москве, где холод и снег, не сижу со своим лучшим другом Андреем Платоновым за стаканом русской водки и не беседую 
с ним о смысле жизни?" 
Москва. Холод. Снег. Андрей Платонов. В ушанке. В валенках. С метлой. Гонится за мальчиком и думает: "Блин, догоню – убью!"'''
,'''Как-то раз ученики сидели с удочками на берегу и ловили рыбу. Подошёл Учитель.
- Не клюёт? – спросил он.
- Не клюёт, - со вздохом сказали ученики.
- И не будет, - сказал Учитель. – У рыб нет клюва.'''
)
